[{"author":{"about":"La tecnología debe estar al servicio de las personas.","domain":"https://jesuspavonabian.es","email":"correo@jesuspavonabian.es","image":null,"name":"Jesús Pavón Abián","nickname":"@jpavonabian"},"categories":null,"content":"Llevo ya un tiempo con el indicativo, unos dos meses y pico. Y aunque menos de lo que me gustaría, he podido salir al aire\u0026hellip; Más o menos. Os cuento mis peripecias.\nPrimeras compras Poner una antena en la azotea no es una opción ahora mismo. en su momento me planteé pillar una con base magnética y plantarla en el balcón, pero he decidido esperar. estoy en trámites de comprarme un piso, no tiene sentido poner nada aquí si me voy a acabar yendo. Esto me limita muchísimo. Solo puedo acceder a las bandas de 2M y 70CM y a los modos digitales. Me encantaría poder salir en HF (soy bastante ambicioso, quiero acceso a la mayoría de bandas) pero bueno, ya habrá tiempo para mejorar.\nDe momento me he pillado lo siguiente:\nMi tarjeta de radioaficionado en PVC para poderla llevar en la cartera por si acaso. Un walkie baratillo para acceder a UHF/VHF, con DMR que integra algo parecido a un lector de pantallas (juraría que sin intención) instalando el Firmware OpenGD77 (viene con su cable de programación): Retevis RT3S DMR Una antena medio decente, que la de porra del Retevis es más mala que un dolor: Retevis RHD771 SMA-M Walkie Talkie Antena Suave Banda Dual VHF/UHF Un Hotspot para DMR ya ensamblado que aquí en Huelva no hay repetidor DMR: AURSINC MMDVM Hotspot como he mencionado, el Retevis RT3S necesita instalar el firmware OpenGD77 para hacerlo hablar. No es difícil, pero sí requiere un poco de tiempo. La guía oficial de instalación de OpenGD77 para Retevis RT3S se puede encontrar aquí y una guía de instalación de OpenGD77 para Retevis RT3S orientada a usuarios de lector de pantalla se puede encontrar aquí. Yo recomiendo echarle un vistazo a ambas guías, pues en la primera se encontrará tanto lo necesario para devolver la radio a su Firmware original si queremos hacerlo como el controlador necesario para que Windows 11 detecte el cable de programación.\nPor desgracia, aunque el OpenGD77 está en español, las guías de instalación están en inglés. Si lo necesitais, sentíos libres de contactarme y trataré de echar una mano.\nSoftware y servicios Lo primero que hice fue registrarme en qrz.com. Es donde se suele buscar el indicativo de la persona con la que hablas. Allí suele aparecer cómo la persona quiere recibir las QSL (tarjetas de confirmación de contacto). También permite llevar un libro de guardia.\nTambién me registré en eQSL.cc, un sitio web para registrar y confirmar eQSL (lo mismo que las QSL pero en formato electrónico).\nFinalmente me registré en LoTW que es el sitio que se suele tomar como referencia para considerar que un contacto es válido.\nPara gestionar todo esto utilizo Amateur Contact Log que es bueno, bonito y accesible. Es de pago, pero merece la pena cuando le pillas el tranquillo (y eso que todavía no puedo sacarle todo el partido porque no tengo acceso a HF). El colega EA3GZA escribió un post comentando las bondades del programa.\nTambién he desarrollado un complemento para NVDA que en mi caso particular me facilita un poco la vida. Se llama Amateur Radio Add-on for NVDA y lo iré actualizando conforme lo vaya necesitando. ¡Se aceptan ideas y Pull Requests!\nPara el DMR utilizo bien sea el walkie o si quiero limitarme a estar en QAP (a la escucha) dejo Mumble abierto, no me gusta usarlo para salir al aire, suena fatal. En DMR conseguí mi primer diploma.\nSuelo usar bastante Echolink. Descubrí la conferencia AELD-ESP, hacen actividades curiosas y allí conseguí mi primer contacto con un japonés. Me habría molado que no hubiese sido a través de un modo digital, pero menos da una piedra. También me suelo quedar en QAP en la conferencia EA3SPAIN, ojalá tener algo así por aquí. Tienen montado un tinglao curioso. Nuevamente EA3GZA escribió un post sobre el Echolink, recomiendo bastante su lectura.\nCreo que no me dejo nada. ¡Nos leemos en la próxima entrada!\n73, EA7LEE\n","date":"2024-12-19T00:00:00Z","site":"https://jesuspavonabian.es/","tags":null,"title":"EA7LEE: Salir al aire","uri":"https://jesuspavonabian.es/post/ea7lee_salir_al_aire/"},{"author":{"about":"La tecnología debe estar al servicio de las personas.","domain":"https://jesuspavonabian.es","email":"correo@jesuspavonabian.es","image":null,"name":"Jesús Pavón Abián","nickname":"@jpavonabian"},"categories":null,"content":"Hace unos días me instalé Thunderbird porque estaba harto de Outlook. Para mi gusto es lento y no termina de ir bien y no me gusta el correo web.\nLo había intentado usar varias veces pero siempre me pasaba lo mismo. Demasiadas cosas en pantalla y la navegación se me hacía engorrosa.\nPor suerte encontré en Mastodon instrucciones para dejarlo perfecto para el uso con un lector de pantallas.\nLas dejo por aquí. Pueden hacerse en el orden que a cada uno le sea más cómodo.\nAñade una cuenta. El asistente para ello aparecerá al iniciar el programa. Cuando veas las carpetas de bandeja de entrada, borradores y demás estarás en la pantalla principal de Thunderbird. Pulsa F8 para desactivar la vista previa, tu yo futuro te lo agradecerá. Abre el menú herramientas pulsando Alt+T, luego pulsa flecha arriba hasta llegar a Ajustes y pulsa Enter. A continuación busca los siguientes elementos y asegúrate de que están configurados como se indica. Bajo el encabezado General encontrarás una casilla llamada \u0026ldquo;Al iniciarse Thunderbird, mostrar la página de inicio en el área de mensajes\u0026rdquo;. Desactívala. Esto eliminará elementos innecesarios en la pantalla principal. Bajo el mismo encabezado encontrarás una casilla llamada \u0026ldquo;Cuando se minimiza Thunderbird, moverlo a la bandeja del sistema\u0026rdquo;. Si quieres encontrarlo más fácil, desmárcala. A gusto del consumidor. En el encabezado Idioma y apariencia encontrarás una casilla llamada \u0026ldquo;Ocultar la barra de título de la ventana del sistema\u0026rdquo;. Desmárcala. Siempre es bueno obtener toda la información posible. En el encabezado Mensajes entrantes encontrarás opciones para modificar el comportamiento del programa. A mi me gusta que las cosas hagan el mínimo de ruído posible, así que tengo desmarcada la casilla de \u0026ldquo;Mostrar una alerta\u0026rdquo; y marcadas las casillas \u0026ldquo;Usar la notificación del sistema\u0026rdquo; y \u0026ldquo;Reproducir un sonido\u0026rdquo;. Bajo el encabezado Lectura y visualización marca la casilla \u0026ldquo;Abrir mensajes Una ventana mens. nueva\u0026rdquo; y si quieres, marca \u0026ldquo;marcar automáticamente mensajes como leídos tras mostrarlos\u0026rdquo;, a gusto del consumidor. Marca también opcionalmente la casilla \u0026ldquo;Cerrar ventana/pestaña del mensaje al moverlo o eliminarlo\u0026rdquo;. Cierra la ventana con CTRL + W. Abre el menú ver con Alt+V y pulsa la flecha derecha en el menú barras de herramientas. Desmarca todo salvo la barra de estado. Esto eliminará cosas innecesarias de la ventana principal. Vuelve al menú Ver con Alt+V y pulsa flecha derecha en Disposición. Pulsa enter en Vista clásica. Esto optimizará la ventana para lector de pantalla. En la ventana principal de Thunderbird pulsa Shift+Tab hasta que encuentres un botón llamado \u0026ldquo;Opciones de visualización de la lista de mensajes\u0026rdquo;. Púlsalo y aparecerá un menú de contexto. Marca la opción \u0026ldquo;Vista de tabla\u0026rdquo;. Finalmente pulsa tab hasta que encuentres una tabla con cabeceras de columna. Si pulsas Alt + Flechas podrás moverlas de sitio, lo que permitirá cambiar la forma en la que aparecerán los distintos datos de los mensajes. si pulsas Enter sobre uno de esos botones, los mensajes se ordenarán por esa columna. ¡Eso es todo!\n","date":"2024-10-26T00:00:00Z","site":"https://jesuspavonabian.es/","tags":null,"title":"Configurar Thunderbird con Lector de pantalla","uri":"https://jesuspavonabian.es/post/configurar-thunderbird-con-lector-de-pantalla/"},{"author":{"about":"La tecnología debe estar al servicio de las personas.","domain":"https://jesuspavonabian.es","email":"correo@jesuspavonabian.es","image":null,"name":"Jesús Pavón Abián","nickname":"@jpavonabian"},"categories":null,"content":"Lo primero que diré: Programar una radio baofeng utilizando un lector de pantallas es un engorro. Ni el software de programación de estos equipos ni el programa libre que hay llamado CHIRP son accesibles al menos que uses alguna distro de Linux, en cuyo caso algo se puede hacer con el anteriormente mencionado.\nPor suerte podemos hacer un par de truquitos de esos que hacemos los usuarios de lector de pantallas para resolver las barreras de accesibilidad, apunta, que el proceso es sencillo: Solo tienes que aprender qué es un CSV, tirar de navegador de objetos de NVDA (asumo que el cursor de JAWS también podría servir) y echarle paciencia.\nConsiguiendo lo necesario en primer lugar, descarga la última versión de CHIRP para Windows. Después descarga la versión del software adecuada para programar tu Baofeng. Los elementos que despliegan las descargas no reciben foco, así que tendrás que usar un poco de magia negra: Ponte encima del elemento con el nombre de tu equipo de radio y pulsa enter. si hay suerte, se desplegarán los enlaces de descarga. si no, tendrás que mover el ratón encima del elemento y dar click de ratón. ¿Tenemos todo? Podemos continuar.\nPreparando el CSV Un CSV es un archivo que almacena elementos separados por comas en forma de tabla. Lo verás más claro con un ejemplo:\nNombre,Apellido\rJosé,Pérez\rAntonio,Flóres Como ves, en la primera línea ponemos lo que sería la cabecera de la tabla y en las siguientes colocamos los distintos valores. Eso se guarda como archivo con extensión csv y se puede usar para alimentar bases de datos, para leerlo más tarde, para exportar contenido a un formato legible por distintas aplicaciones al ser texto plano\u0026hellip;\nPues un CSV es lo que necesitamos para configurar nuestro cacharro, ya que meter los datos a mano es inaccesible, aunque sería mucho más cómodo y menos propenso a errores. Los campos que requiere nuestro CSV son los siguientes:\nLocation,Name,Frequency,Duplex,Offset,Tone,rToneFreq,cToneFreq,DtcsCode,DtcsPolarity,Mode,TStep,Comment Colocando eso como primera línea en nuestro archivo .csv solo tendríamos que rellenar las siguientes filas con la información de los canales que queremos añadir, dejando vacíos los campos que no nos interesen. Por ejemplo:\n6,ISS,437.800000,-,-0.145000,CTCSS,67.0,67.0,023,NN,FM,5,\u0026#34;ISS Repeater\u0026#34; ´Significa lo siguiente:\nLocation:\nValor: 6 Explicación: Es el canal o ubicación en una lista de repetidores. En este caso, el número 6 está asociado a este repetidor. Name:\nValor: ISS Explicación: Nombre del repetidor. En este caso, es el repetidor de la Estación Espacial Internacional (International Space Station, ISS). Frequency:\nValor: 437.800000 MHz Explicación: Frecuencia de operación del repetidor. En este caso, transmite en 437.8 MHz. Duplex:\nValor: - Explicación: El valor \u0026ldquo;-\u0026rdquo; indica que la frecuencia es de bajada (downlink), es decir, la frecuencia a la que el repetidor transmite hacia los usuarios. Si estuviera vacío, indicaría que no hay una diferencia entre la frecuencia de transmisión y recepción. Offset:\nValor: -0.145000 MHz Explicación: Diferencia entre la frecuencia de recepción (transmisión del usuario) y la frecuencia de transmisión del repetidor. Aquí se especifica un desplazamiento negativo de 145 kHz. Tone:\nValor: CTCSS Explicación: Tipo de tono usado para acceder al repetidor. rToneFreq:\nValor: 67.0 Hz Explicación: La frecuencia del tono CTCSS (tono de silenciamiento) para transmisión (TX). Aquí, el tono requerido es 67.0 Hz. cToneFreq:\nValor: 67.0 Hz Explicación: La frecuencia del tono CTCSS para recepción (RX). En este caso, es también 67.0 Hz, coincidiendo con el tono de transmisión. DtcsCode:\nValor: 023 Explicación: Código DCS (Digital Coded Squelch) que puede ser usado en lugar del CTCSS. Aquí se especifica el código 023. DtcsPolarity:\nValor: NN Explicación: Polaridad DCS, que indica la dirección de la codificación digital (normal o invertido). Aquí NN significa normal en transmisión y normal en recepción. Mode:\nValor: FM Explicación: El modo de transmisión que utiliza el repetidor. En este caso, es FM (Frecuencia Modulada). TStep:\nValor: 5 Explicación: Este es el paso de frecuencia o el \u0026ldquo;step\u0026rdquo; que se utiliza al ajustar manualmente la frecuencia. Aquí, es un paso de 5 kHz. Comment:\nValor: \u0026quot;ISS Repeater\u0026quot; Explicación: Comentario adicional o información descriptiva sobre el repetidor. En este caso, se menciona que es el repetidor de la ISS. Otro ejemplo de repetidor es el siguiente:\n2,\u0026#34;ED7YAX Huelva\u0026#34;,438.625000,-,7.6,Tone,88.5,88.5,023,NN,FM,5,\u0026#34;Huelva\u0026#34;, Resuelto el tema de los CSV (Repeater Book es tu amigo si no quieres hacerlos a mano o modificarlos lo mínimo posible) toca subirlos a la radio.\nSubir el CSV a la radio No es difícil, aún así lo dejo documentado.\nEncendemos la radio con el volumen al máximo. Le colocamos el cable de programación y lo enchufamos a un USB libre. \u0026ndash; Abrimos CHIRP. Pulsamos alt para ir a la barra de menús y buscamos el menú radio con las flechas. Pulsamos en la opción de descargar desde radio. Seleccionamos el controlador y el puerto. Pulsamos aceptar y esperamos que la barra de porcentaje llegue al 100. Guardamos con CTRL + S la imagen de la radio por si algo sale mal poder restaurarla. Pulsamos CTRL+Tab hasta llegar a la lista de pestañas y seleccionamos la de memoria. Con la pestaña seleccionada, sin hacer nada más que seleccionarla, pulsamos alt para ir a la barra de menú y seleccionamos importar. Localizamos nuestro archivo CSV y volvemos a darle a importar. cuando esté todo listo, volvemos a la barra de menú y le damos a cargar a la radio desde el menú radio, seguimos las instrucciones y si todo va bien y no tenemos ningún error tendremos los canales colocados en nuestra Baofeng y podemos desconectarla. ¿Y entonces para qué me has hecho descargar el software de programación original? Con CHIRP no podemos acceder a programar todos los parámetros. Con el Software de programación original y la ayuda del navegador de objetos y mucha paciencia podemos toquetear el resto de parámetros. Es bastante intuitivo, y si hemos hecho todo bien, tendremos un .img con la configuración de fábrica que podremos restaurar desde CHIRP desde la opción adecuada de la barra de menú, abriéndolo antes de enchufar la radio y cargándolo sin bajar los datos antes.\nEspero que este post sirva al menos para poder empezar a trastear con estos equipos. Por cierto, el Martes pasado me dieron el indicativo, soy EA7LEE.\n","date":"2024-10-06T16:47:59+02:00","site":"https://jesuspavonabian.es/","tags":null,"title":"Programación de radios Baofeng a ciegas","uri":"https://jesuspavonabian.es/post/programacion-radios-baofeng-a-ciegas/"},{"author":{"about":"La tecnología debe estar al servicio de las personas.","domain":"https://jesuspavonabian.es","email":"correo@jesuspavonabian.es","image":null,"name":"Jesús Pavón Abián","nickname":"@jpavonabian"},"categories":null,"content":"Hace poco cambié la instancia de Mastodon para que se ejecutase utilizando Docker. Esto me facilitó la vida en muchos aspectos y me la complicó en el de limpiarla. El script que tenía para ello no funcionaba.\nAsí que cuando saqué un poco de tiempo libre decidí arreglar el asunto.\nOs comparto aquí ambos scripts por si a alguien le sirve.\nScript para Mastodon en Docker #!/bin/bash\r# Limpiamos la instancia de Mastodon en Docker\r# Definir el nombre del contenedor\rCONTAINER_NAME=live_web_1\r# Ejecutar los comandos dentro del contenedor\rdocker exec -it $CONTAINER_NAME bin/tootctl statuses remove --days 90\rdocker exec -it $CONTAINER_NAME bin/tootctl media remove --days 5\rdocker exec -it $CONTAINER_NAME bin/tootctl media remove --prune-profiles --days 5\rdocker exec -it $CONTAINER_NAME bin/tootctl media remove --attachments --avatars --headers --days 5\rdocker exec -it $CONTAINER_NAME bin/tootctl media remove-orphans\rdocker exec -it $CONTAINER_NAME bin/tootctl preview_cards remove --days 90\rdocker exec -it $CONTAINER_NAME bin/tootctl accounts prune\rdocker exec -it $CONTAINER_NAME bin/tootctl accounts cull\rdocker exec -it $CONTAINER_NAME bin/tootctl cache clear\rdocker exec -it $CONTAINER_NAME bin/tootctl emoji purge --remote-only\rdocker exec -it $CONTAINER_NAME bin/tootctl cache recount accounts\rdocker exec -it $CONTAINER_NAME bin/tootctl cache recount statuses Script para Mastodon sin Docker #!/bin/bash\r# Limpiamos la instancia\rRAILS_ENV=production /home/mastodon/live/bin/tootctl statuses remove --days 90\rRAILS_ENV=production /home/mastodon/live/bin/tootctl media remove --days 5\rRAILS_ENV=production /home/mastodon/live/bin/tootctl media remove --prune-profiles --days 5\rRAILS_ENV=production /home/mastodon/live/bin/tootctl media remove --attachments --avatars --headers --days 5\rRAILS_ENV=production /home/mastodon/live/bin/tootctl media remove-orphans\rRAILS_ENV=production /home/mastodon/live/bin/tootctl preview_cards remove --days 90\rRAILS_ENV=production /home/mastodon/live/bin/tootctl accounts prune\rRAILS_ENV=production /home/mastodon/live/bin/tootctl accounts cull\rRAILS_ENV=production /home/mastodon/live/bin/tootctl cache clear\rRAILS_ENV=production /home/mastodon/live/bin/tootctl emoji purge --remote-only\rRAILS_ENV=production /home/mastodon/live/bin/tootctl cache recount accounts\rRAILS_ENV=production /home/mastodon/live/bin/tootctl cache recount statuses Modo de uso: Tras guardarlo como limpiar.sh podeis meterlo en un Crontab y ejecutarlo una vez al mes o ejecutarlo a mano, como os resulte más práctico. ¡Cuidado con Docker! No olvideis cambiar la variable CONTAINER_NAME para que apunte a vuestro contenedor de web.\n","date":"2024-09-15T13:15:29+02:00","site":"https://jesuspavonabian.es/","tags":null,"title":"Limpiar instancia de Mastodon","uri":"https://jesuspavonabian.es/post/limpiar_instancia_de_mastodon/"},{"author":{"about":"La tecnología debe estar al servicio de las personas.","domain":"https://jesuspavonabian.es","email":"correo@jesuspavonabian.es","image":null,"name":"Jesús Pavón Abián","nickname":"@jpavonabian"},"categories":null,"content":"Por culpa de esto he recuperado las ganas de sacarme la licencia de Radioaficionado.\nNo, no voy a dar una charla escrita sobre radioafición ni nada parecido, pues si algo me caracteriza por estas fechas es que no tengo ni puta idea.\nSi quereis cotillear sobre radioafición accesible teneis a EA3GZA (Miguel), radioaficionado ciego) que os podrá contar muchísimo mejor que yo lo que mola esto, lo accesible que es (o no) y lo que se puede o no puede hacer. De hecho le escribí a su correo de la unión de radioaficionados españoles y me envió un tochaco importante para luego seguir hablando por WhatsApp.\nLo que voy a hacer en esta entrada es recopilar recursos accesibles para aprobar el examen que da derecho a pedir el indicativo, entre otras cosas para tenerlos yo a mano, ya que los voy descubriendo y se me olvidan. Cuando lo consiga, haré una entrada a modo de curiosidad sobre el equipo que me compre, que si os soy sincero, no tengo ni la más mínima idea de cuál va a ser. Tampoco me he puesto a mirar mucho; no quiero correr antes de aprender a andar, que luego me llevo una hostia tamaño king size y no es plan.\nSi queremos poder operar una estación de Radioaficionado necesitamos conseguir una autorización administrativa individualizada otorgada por la Secretaría de Estado para la Sociedad de la Información y la Agenda Digital. Lo que viene siendo, simplificando mucho, que tenemos que aprobar un examen y luego pedir el indicativo antes de hacer cualquier otra cosa, porque si no estaremos incumpliendo la ley e incumplir la ley es malo. Teneis el proceso que hay que seguir aquí.\nPor desgracia para mi, aunque la URE tiene una cantidad de información brutal, me perdí con solo leer el enlace anterior. Por suerte me pasaron un vídeo donde se explica el proceso de una forma bastante amena que incluso tiene enlaces en la descripción para que no tengamos que preocuparnos en encontrar lo necesario.\nCon esto claro decidí centrarme en aprobar el examen. Nuevamente la URE vino a mi rescate, pues pone a nuestra disposición un montón de exámenes para practicar. Por desgracia para mi la parte de radioelectricidad no me entraba en la cabeza por mucho que estudiaba y buscaba en internet. Basta con acertar 15 preghuntas, pero entre las de dibujitos y que me faltaban conocimientos básicos la cosa estaba chunga chunga.\nEA3GZA vino a mi rescate y me comentó que hay un libro en la biblioteca digital de la ONCE para preparar el examen. Y raudo y veloz fui a descargarlo\u0026hellip; Para decepcionarme rapidísimo. Tengo un problema con la lectura en formato DAISY. No me sirve para estudiar, acabo con la cabeza hecha un bombo, la lectura no me es cómoda. Está por suerte también en formato .bra. Desgraciadamente, el libro no es válido para estudiar debido al cambio de normativa en 2013. Miguel me comentó también que hay un libro llamado \u0026ldquo;La radioafición mola\u0026rdquo;, pero al ir a buscarlo en digital no parece estar por ningún sitio, así que F.\nEl Radio Club Utiel ha publicado en su web un libro para preparar el examen en pdf que se puede leer con alguna que otra dificultad, pues no tiene etiquetas y el Adobe Acrobat tiene que inventárselas.\nPero como soy medio cazurro y me faltan conocimientos de electricidad solo me sirve para estudiarme las preguntas a saco y aprobar sin saber el por qué.\nTras meditarlo durante un par de días decidí inscribirme al Curso para preparar el examen de la URE y se solucionaron mis problemas. Lo explica todo desde el inicio, Empezando por qué es una molécula. Y lo mejor de todo, simple para cazurros como yo, que lo único que sabía de la electricidad es que da calambre y que hace que las cosas funcionen. Es curioso como de Software puedo tirarme hablando horas y en el momento que me meto con algo de Hardware me cortocircuita el cerebro.\nUna semana antes de presentarme al examen encontré los exámenes de la web de la Ure Valencia que permiten aprender haciendo test. Cuando fallas una pregunta te dice por qué la has fallado. Y aunque la revisión no es accesible porque las preguntas incorrectas las marca en rojo, puedes hacerte una idea de cómo va. Si utilizas estos test además de los que se encuentran en la URE, deberías tener suficiente, ya que estos últimos test son más específicos en el tema radioeléctrico.\nMe ha costado lo suyo encontrar un resumen del Plan de Bandas accesible. Todo lo que encontraba estaba en imágenes o en tablas con semántica incorrecta, lo que hacía casi imposible enterarse de algo.\nSi no hubiera suficiente material de estudio, hace un par de días Youtube me recomendó este curso de radioaficionado que no está tampoco nada mal, aunque no lo he usado más que para tenerlo de fondo mientras hacía cosas por casa.\nel examen hay que solicitarlo con Cl@ve o Certificado Digital. Tienes todo lo necesario aquí. El modelo 790 que verifica que has pagado las tasas del examen se puede encontrar en esta página. Tened paciencia, el formulario que genera el PDF no tiene etiquetas asociadas y para hacerlo aún menos accesible está formado por una tabla que por supuesto, no tiene tampoco una semántica correcta, lo que implica que hay que tirar de memoria para rellenar los campos.\n","date":"2024-09-02T00:00:00Z","site":"https://jesuspavonabian.es/","tags":null,"title":"EA7Algo","uri":"https://jesuspavonabian.es/post/ea7algo/"},{"author":{"about":"La tecnología debe estar al servicio de las personas.","domain":"https://jesuspavonabian.es","email":"correo@jesuspavonabian.es","image":null,"name":"Jesús Pavón Abián","nickname":"@jpavonabian"},"categories":null,"content":"¡Buenas! Hoy os traigo un tutorial para instalar y configurar un cliente Torrent en una Raspberry Pi. Lo tenía configurado desde hace un par de meses pero soy un desastre, así que he decidido convertir mis apuntes en un tutorial para que no se me olvide. Con suerte le vale a alguien.\nUtilizaremos Transmission, un cliente Torrent ligero y eficiente. También configuraremos un disco duro externo como almacenamiento para nuestras descargas.\nPaso 1: Conectar el Disco Duro Si vamos a usar un disco duro externo para almacenar nuestras descargas, primero debemos conectarlo a la Raspberry Pi y verificar su ubicación en el sistema. Abrimos una terminal y utilizamos el siguiente comando para identificar el disco duro:\nlsblk -fm\nEn mi caso, el disco duro está ubicado en /dev/sda1.\nPaso 2: Montar el Disco Duro Montamos el disco duro en el sistema editando el archivo /etc/fstab:\n`sudo nano /etc/fstab```\nAñadimos la siguiente línea al final del archivo para montar el disco duro en /mnt/disco (puede cambiarse \u0026ldquo;disco\u0026rdquo; por otro nombre si se prefiere):\n/dev/sda1 /mnt/disco ntfs defaults 0 0\nGuardamos los cambios presionando Control + X, tecleamos Y y presionamos ENTER. Luego, reiniciamos el sistema para aplicar los cambios:\nsudo reboot\nAsumiremos que la ruta de nuestro disco es /mnt/disco.\nPaso 3: Instalar Transmission Una vez que el disco duro está montado, procedemos a instalar Transmission:\nsudo apt install transmission-daemon\nDetenemos el servicio de Transmission para configurarlo:\nsudo service transmission-daemon stop\nPaso 4: Configurar Transmission Editamos el archivo de configuración de Transmission:\nsudo nano /etc/transmission-daemon/settings.json\nRealizamos las siguientes modificaciones:\nDirectorio de descargas: Configuramos la ruta donde se guardarán nuestros archivos descargados.\r\u0026#34;download-dir\u0026#34;: \u0026#34;/mnt/disco/descargas\u0026#34;,\rNúmero máximo de peers globales.\r\u0026#34;max-peers-global\u0026#34;: 200,\rPuerto de conexión.\r\u0026#34;peer-port\u0026#34;: 51413,\rLímite de peers por torrent.\r\u0026#34;peer-limit-per-torrent\u0026#34;: 50,\rUsuario y contraseña para la interfaz web: Configuramos el usuario y la contraseña (se cifrará automáticamente al iniciar el servicio).\r\u0026#34;rpc-username\u0026#34;: \u0026#34;USUARIO\u0026#34;,\r\u0026#34;rpc-password\u0026#34;: \u0026#34;CONTRASEÑA\u0026#34;,\rPuerto para la interfaz web.\r\u0026#34;rpc-port\u0026#34;: 9091,\rWhitelist para la interfaz web: Desactivamos la whitelist para permitir el acceso a la interfaz web desde cualquier IP.\r\u0026#34;rpc-whitelist-enabled\u0026#34;: false, Guardamos los cambios presionando Control + X, tecleamos Y y presionamos ENTER.\nPaso 5: Gestionar Permisos Editamos el archivo de inicio de Transmission para cambiar el usuario a root:\nsudo nano /etc/init.d/transmission-daemon\nModificamos la línea USER=debian-transmission a USER=root. Guardamos los cambios presionando Control + X, tecleamos Y y presionamos ENTER. A continuación, cambiamos el propietario y los permisos del directorio del disco:\nsudo chown -R root /mnt/disco sudo chmod -R 755 /mnt/disco\nPaso 6: Iniciar Transmission Finalmente, iniciamos el servicio de Transmission:\nsudo service transmission-daemon start\nPaso 7: Disfrutar ¡Eso es todo! Ahora podemos acceder a http://ip:9091 e iniciar sesión con las credenciales que pusimos en el archivo de configuración.\n","date":"2024-07-02T00:00:00Z","site":"https://jesuspavonabian.es/","tags":null,"title":"Instalar un cliente Torrent en una raspberry Pi","uri":"https://jesuspavonabian.es/post/instalar-cliente-torrent-raspberry-pi/"},{"author":{"about":"La tecnología debe estar al servicio de las personas.","domain":"https://jesuspavonabian.es","email":"correo@jesuspavonabian.es","image":null,"name":"Jesús Pavón Abián","nickname":"@jpavonabian"},"categories":null,"content":"Los otros días me encontré con que las voces de Microsoft no reproducían contenido, aparentemente.\nTras mucho darle vueltas y Googlear en el soporte de Microsoft no encontré nada y acabé bastante frustrado.\nResulta que al final, en contra de lo que yo pensaba, sí que se reproducían los audios que generaban esas voces. Tuve que hacerme un Script en Python para poder probarlo.\nEntonces, si los audios se reproducían, ¿por qué yo no escuchaba nada?\nLa respuesta estaba en el configurador de Sapi, que no puede estar más escondido. Se había cambiado el dispositivo de salida de estas voces.\n¿La solución? ir a \u0026ldquo;C:\\Windows\\SysWOW64\\Speech\\SpeechUX\\sapi.cpl\u0026rdquo; y cambiar el dispositivo de salida al predeterminado del sistema.\n¡Espero que a alguien le sirva este minipost!\n","date":"2024-06-28T00:00:00Z","site":"https://jesuspavonabian.es/","tags":null,"title":"TTS No Habla","uri":"https://jesuspavonabian.es/post/tts-no-habla/"},{"author":{"about":"La tecnología debe estar al servicio de las personas.","domain":"https://jesuspavonabian.es","email":"correo@jesuspavonabian.es","image":null,"name":"Jesús Pavón Abián","nickname":"@jpavonabian"},"categories":null,"content":"Actualizada el 9 de Octubre de 2024.\nRecientemente he comenzado a jugar Diablo IV y me he dado cuenta de que no hay nada de información sobre su accesibilidad en español. Así pués, basándome en esta guía del foro de audiogames he decidido documentar lo que vaya encontrando. La iré actualizando por mi cuenta, pero si sabes inglés, recomiendo echarle un vistazo.\nGracias, UltraLeetJ.\nEsta guía está en progreso y la actualizaré a medida que encuentre nuevas cosas. Hay algunos hilos en en el foro de Audiogames sobre la discusión general del juego, pero el más completo es este (preguntas sobre diablo en inglés). También hay una versión recuperada del año pasado para la ¿wiki ciega? y un servidor de discord para hablar sobre el juego en inglés también.\nDiablo IV es un juego de rol de acción en línea, de rastreo de mazmorras, desarrollado y publicado por Blizzard Entertainment en 2023. Usas tus habilidades para completar misiones a través del combate. También puedes tener un clan y hacer combates jugador contra jugador. Lee todo sobre ello en su entrada en wikipedia. Para obtener el juego puedes hacerlo desde el sitio de Diablo IV de Blizzard, el juego está también disponible en Steam. Para jugar, puedes usar un ratón y teclado o un controlador, o ambos, aunque para la mejor experiencia un controlador es esencial, ya que puedes navegar y configurar las opciones del juego de esta manera. El juego también tiene descuentos de vez en cuando, así que estate atento.\nconfiguración y cosas útiles para descargar Yo utilizo la versión de Battle.net. Es probable que el lector de pantallas no lea nada cuando abras el juego por primera vez, pero abordaremos eso más adelante. ¡sigue leyendo! Nota para usuarios de Steam o Xbox: para hacer las cosas mucho más fáciles, deberías conectar o enlazar tus cuentas de Steam o Xbox y Battle.net desde esta página antes de comenzar el juego. Te conectarás automáticamente tan pronto como el juego se ejecute y el lector de pantalla te notificará todo, también automáticamente.\nLa primera pantalla en la que aterrizas si ya estás conectado es el lector de pantalla para el juego. Al presionar confirmar aquí (el botón A en los controladores de Xbox, el botón X en los controladores de PlayStation) dejarás que el juego sepa que deseas habilitar el lector de pantalla y luego serás llevado a una pantalla de brillo. Puedes presionar el mismo botón de confirmación y luego serás llevado a la pantalla de selección de resaltado. Desde aquí, deberías haber recibido algún discurso ya sea a través de cualquier voz de OneCore, o cualquiera de las disponibles en el panel de control de Windows 10/11. Si este no es el caso, consulta la sección de solución de problemas del lector de pantalla a continuación.\nSi llegas a la pantalla de configuración, usa los botones R1 o R2 para moverte entre las distintas categorías. Luego, confirma tus cambios cuando estés en la última categoría a la derecha y estarás casi listo. También puedes habilitar lectores de pantalla de terceros como NVDA (asegurándote de obtener los archivos del cliente de controlador de NVDA dentro de la carpeta ejecutable de Diablo) y JAWS (funciona sin necesidad de utilizar ninguna configuración).\nA lo largo de todo este tiempo la comunidad ha estado creando cosas increíbles para el juego. Puedes instalar el complemento de normalizador de codificación y ver su hilo en el foro de audiogames en inglés aquí. También puedes obtener los archivos del cliente de NVDA para colocar dentro del directorio en el que Diablo está instalado, en Steam es: C:\\Program Files (x86)\\Steam\\steamapps\\common\\Diablo IV y por defecto desde Battle.net es: C:\\Program Files\\Diablo\\. Usa este enlace, luego busca el último enlace para el zip del cliente de controlador.\nnavegación y uso del juego Una de las preguntas más comunes que la gente tiene es cómo navegar por el juego.\nUno de los botones que usarás mucho es el botón para la pantalla del mapa. En Xbox es el botón de vista o menú (el izquierdo opuesto a pausa/inicio), en el teclado es m, y en PlayStation es el panel táctil.\nNecesitas recordar dos cosas. primero, puedes teletransportarte a los puntos de referencia en el mapa una vez que los hayas encontrado. segundo, necesitas explorar usando el mapa y haciendo zoom para encontrar cosas.\nPor ejemplo, abre la pantalla del mapa. Para hacer zoom usas el stick derecho (escucharás un sonido de vibración cuando cambie el nivel de zoom), usa el stick derecho hacia abajo para alejar, el stick derecho hacia arriba para acercar. aleja todo el camino, luego acércate un nivel. usa el stick izquierdo, muévelo ligeramente hacia la derecha, luego presiónalo para centrar la cámara en ti mismo. muévelo hacia arriba y hacia la derecha, centra. luego hacia arriba, luego centra. luego hacia arriba y hacia la izquierda, luego presiónalo para centrar de nuevo.\nAsí es como encuentras cosas. también puedes ir arriba arriba centro, abajo abajo centro, si algo está más lejos.\nTambién puedes presionar el stick derecho en la pantalla del mapa para filtrar qué lugares se te anuncian a medida que te mueves por el mapa. Cuando desbloqueas un punto de referencia, en el mapa, cada vez que lo encuentras puedes presionar el botón X en él para teletransportarte.\nUna vez has seleccionado un objetivo en el mapa y has salido de él se activará el sistema de navegación de audio si lo tienes activado en las opciones del juego.\nEs un sistema confuso al principio, pero potente. Consta de tres sonidos:\nUno de ellos es una especie de tambor tocando 3 veces. Significa que vas mal encaminado. Otro es el mismo tambor, pero con un ligero click. Eso significa que estás yendo a una dirección aproximada de tu objetivo. Si se oye más el click que el tambor, estás bien encaminado. Cuando estés en la primera parte del prólogo, Anochecer en la Montaña, te encontrarás con algunos enemigos a los que tendrás que atacar. El juego tiene audio posicional para que puedas apuntar y atacar con éxito. También puedes configurar desde las opciones si el bloqueo de enemigos se realiza automáticamente y también puedes usar el stick derecho para seleccionar y presionarlo para bloquear un objetivo.\nTambién es una buena idea tener el complemento de Speech history de NVDA, ya que algunos controles, como en la pantalla del mapa, no se anuncian ya que el discurso se trunca de alguna manera incluso con el lector de pantalla incluido, y anuncia los dos últimos, pero si revisas el texto anunciado aquí se revelará todo.\nsolución de problemas del lector de pantalla Entonces, comenzaste el juego y cero discurso, incluso después de saltarte el mensaje del lector de pantalla\u0026hellip; ¿qué hacer ahora? primero que todo, usa OCR para confirmar que las pantallas están cambiando. Los sonidos cuando mueves el cursor y confirmas opciones se reproducen incluso si no se lee nada. Esto normalmente y a menudo ocurre cuando tienes un idioma diferente y no está completamente instalado, o voces rotas en la configuración de Windows 10/11. Ten en cuenta que incluso si obtienes asistencia visual, el lector de pantalla no se habilitará hasta que resuelvas cualquier problema con las voces de OneCore y/o sapi5 de Windows. Así que primero, sal del juego, y ve al panel de control, y abre la categoría de idioma, hora y región, luego tabula para elegir la subsección voz que es la última en la lista. Luego tabula alrededor hasta que escuches, elige una voz, y cambia la voz a la primera disponible. Esa es la que el juego espera y usará. Para asegurarte de que se reproduce, selecciona el botón de vista previa de voz. Si no se reproduce, entonces necesitas reinstalar los paquetes de idiomas haciendo lo siguiente: Desde esta pantalla, vuelve a la lista de subsecciones para hora e idioma, y luego desde allí elige la segunda, idioma y región. Tabula dos veces para agregar un idioma, selecciónalo de la lista, asegúrate de que haya texto a voz disponible para él (se anunciará cuando selecciones el idioma), y luego presiona siguiente. Luego, una vez dentro de ese diálogo, desmarca todo excepto texto a voz y luego presiona instalar. Dale unos minutos, se anunciará el progreso y la instalación se completará. Luego previsualiza tus voces nuevamente. Si no suenan, hay un último recurso en el juego pero tienes que asegurarte de tener instalado y funcionando el idioma inglés de Estados Unidos de texto a voz, más específicamente la voz de Microsoft David (escritorio). Luego ve a Steam y cambia el idioma del juego a inglés, esto provocará y desencadenará una descarga de 1 GB. El juego debería funcionar ahora en inglés. Luego puedes habilitar el lector de pantalla de terceros, guardar tus opciones, y tan pronto como lo hagas, sal del juego y luego cámbialo al idioma que quieras usar (en este momento sé que inglés, español, francés, italiano y portugués son compatibles con lectores de pantalla). Esto provocará otra descarga de aproximadamente 1 GB (imagino que para diálogos y demás), pero al menos obtendrás el juego funcionando. Para comprobar que las preferencias se están guardando correctamente, puedes inspeccionar el archivo local prefs.txt en tu carpeta de documentos\\diablo IV.\n","date":"2024-06-24T00:00:00Z","site":"https://jesuspavonabian.es/","tags":null,"title":"Guía de configuración de la accesibilidad de Diablo IV","uri":"https://jesuspavonabian.es/post/guia-de-configuracion-de-accesibilidad-de-diablo-iv/"},{"author":{"about":"La tecnología debe estar al servicio de las personas.","domain":"https://jesuspavonabian.es","email":"correo@jesuspavonabian.es","image":null,"name":"Jesús Pavón Abián","nickname":"@jpavonabian"},"categories":["Informática"],"content":"Una de las cosas que echaba de menos en Firefox es el cambio que se hizo en el motor Chromium con respecto al tema de las imágenes sin alt.\nLo que se ha hecho es añadir un atributo alt avisando de que no hay descripción en las imágenes que no tienen dicho atributo. Y puede parecer una tontería, pero a ellos les viene bien para que le des click derecho y actives el autodescriptor de imágenes, bien sea el de Google o el de Edge, y a los que utilizamos lector de pantallas nos viene espectacular porque tengamos o no la descripción inteligente de imágenes activa sabemos que hay una imagen y puede ser importante (aunque en la mayoría de casos, al menos en mi experiencia sea decorativa).\nAsí que me he hecho un script de Tampermonkey que arregla el problema. No tiene acceso a un descriptor de imágenes (más que nada porque pese a que sería posible sería también carísimo pedirle a GPT o similares descripciones cada vez que se carga una imagen sin alt), pero para hacer auditorías de accesibilidad y para navegar por algunas páginas webs donde las imágenes deberían tener un alt especificando qué son y directamente no lo tienen me es bastante útil.\nLo dejo por aquí porque si sabes qué estás haciendo (o buscando) puede ahorrar varios dolores de cabeza.\nSolo necesitais (una vez instalada la extensión) pulsar en el enlace del script de Tampermonkey, instalarlo y dejar que haga su magia.\nCuando navegueis por la web y se encuentre una imagen sin atributo alt, el script le añadirá uno avisando de que la imagen no tiene alt.\n","date":"2024-03-31T00:00:00+02:00","site":"https://jesuspavonabian.es/","tags":["Informática"],"title":"Script para añadir alt a imágenes","uri":"https://jesuspavonabian.es/post/script-anadir-alt-a-imagenes/"},{"author":{"about":"La tecnología debe estar al servicio de las personas.","domain":"https://jesuspavonabian.es","email":"correo@jesuspavonabian.es","image":null,"name":"Jesús Pavón Abián","nickname":"@jpavonabian"},"categories":null,"content":"Que google sabe muchísimo sobre nosotros es un hecho, no estoy diciéndoos nada nuevo. Lee nuestros correos electrónicos, utiliza nuestros recivos de compras para registrarlas (a saber con qué objetivo, no quiero pensarlo mucho), sabe dónde estamos y cuánto tiempo hemos estado en algún sitio, si queremos comprarnos una lavadora nueva porque lo hemos buscado en su potentísimo buscador\u0026hellip; Lo dicho, No os digo nada nuevo. Cuando el servicio es gratis, el producto es el usuario.\nY a la mayoría de la gente le da igual. Las cosas funcionan y no tienen que complicarse la vida. De hecho, cuando lo he comentado con familiares y amigos, la respuesta ha sido algo como \u0026ldquo;ya, ¿y qué? Estamos fichados por todos lados. ¿Qué van a sacar de ti porque sepan que quieras comerte una pizza?\u0026rdquo;\nQuizás me esté volviendo paranoico, quizás me haya dado muy fuerte y tenga el coco comido de tanto leer gente en el Fediverso, pero desde que he empezado a des-googlear mi vida estoy más tranquilo.\nLos anuncios han desaparecido casi por completo como comenté en otra entrada, y los que veo, ya no están tan personalizados, algún que otro servicio queda por ahí rastreando. Sé que mi correo es \u0026ldquo;mío\u0026rdquo; (cuidado con las comillas) y está cifrado. Mis resultados de búsqueda han variado muchísimo. Os parecerá mentira, pero he llegado a notar el sesgo, pude comprobarlo al buscar desde dispositivos distintos, variaban los resultados. No dependo de un solo proveedor. Al final, depender del servicio que sea únicamente no siempre es lo mejor. Uso Software Libre. Primero, el correo Ha sido lo más fácil, aunque suene extraño. Una de las características más útiles de ProtonMail para mi gusto es la opción de reenviar automáticamente los correos de la antigua cuenta de Gmail al nuevo correo. Avisar a la gente de que he cambiado de correo es un coñazo y lo estoy tomando con calma, pero gracias a esto puedo permitirme ese lujo.\nOtra cosa que mola de ProtonMail es la gran cantidad de enlaces directos a las opciones para cambiar el correo de distintos sitios. ¿Quieres cambiar tu correo de GitHub, por decir algún servicio? Pulsas el enlace adecuado y plaf, directo a la opción.\nComo dije más arriba, los correos están cifrados. Según su web, \u0026ldquo;Proton nació en Suiza en 2014, cuando un equipo de científicos que se conocieron en el CERN (la Organización Europea de Investigación Nuclear) decidió construir un mejor Internet con la privacidad como estandarte.\u0026rdquo;\nTienen una cuenta de pagho que permite usar dominio propio, así que creo que acabaré migrando el correo que tengo con Apple, así unifico de paso ambos correos y no tengo todo esperriado por la red y me quito la dependencia de otra BigTech.\nEn un principio me planteé hacer SelfHost del correo, pero por muy tentador que es, hay cosas que prefiero que gestione gente que sabe más que yo, que me minimizan riesgos.\nSearxNG, el metabuscador Está clarísimo. Si hablamos de buscar en internet, lo primero que se nos viene a la cabeza es Google. Es cierto que hay otros como Bing, pero la gran mayoría de mis conocidos es lo que usa.\nLe estuve dando vueltas a la cuestión durante mucho tiempo. Podría usar DuckDuckGo o un navegador similar, pero por alguna razón, nunca dí el paso. Estaba también Ecosia, el buscador que planta árboles, pero tampoco pude migrar a él.\nFinalmente descubrí SearxNG y tras hprobarlo durante un tiempo, acabó como buscador principal en Firefox.\nSearxNG no es un buscador per se. Es lo que se llama un Metabuscador. Lo que hace es utilizar varios buscadores para mostrarte los resultados, sin almacenar las búsquedas que realizas. Respeta la privacidad y hace imposible a cualquiera de dichos buscadores rastrear tus búsquedas.\nPuedes usar una instancia pública o crear la tuya propia, como he hecho yo. No pide registros de ningún tipo. Cuando accedes, si modificas las preferencias, guarda una Cookie en tu navegador con ellas para actuar como tú quieras que actúe.\nEs código libre, por lo que cualquiera puede echar una mano o plantear mejoras al proyecto, o si se tiene la inspiración suficiente, crear una bifurcación.\nEs bastante flexible y poderoso. ¿Quieres evitar los muros de pago? Configúralo en las preferencias.\nSi quieres, puedes probarlo accediendo a la instancia que he montado, que tras un par de meses de pruebas he decidido hacer pública.\nTodavía falta Lo siguiente que voy a fusilar va a ser Dropbox, Google Drive e iCloud Drive, en ese orden. Haré otra entrada explicando qué voy a montarme.\nLa idea no es dejar de usar definitivamente estos servicios, sea Google o sea cual sea. La idea es usarlos lo menos posible, controlar qué datos tienen míos y usarlos para lo que yo quiero usarlos, como yo quiero usarlos y cuando yo quiero usarlos. ¿Sería lo ideal prescindir de ellos por completo? Sí, pero actualmente es complicado.\nLa tecnología tiene que estar al servicio de las personas.\n","date":"2024-01-28T23:01:28+01:00","site":"https://jesuspavonabian.es/","tags":null,"title":"Desgooglezando Mi Vida","uri":"https://jesuspavonabian.es/post/desgooglezando-mi-vida/"},{"author":{"about":"La tecnología debe estar al servicio de las personas.","domain":"https://jesuspavonabian.es","email":"correo@jesuspavonabian.es","image":null,"name":"Jesús Pavón Abián","nickname":"@jpavonabian"},"categories":null,"content":"Hace ya casi un año, cuando creé la instancia de Mastodon Universo alterno, Sukil me comentó algo como \u0026ldquo;Hey, ya que estás con el tema del fediverso, ¿no quieres ser un ciudadano de IndieWeb?\u0026rdquo;\nY como soy una persona curiosa, me puse a investigar. Pero como sabeis, esta página estaba hecha con WordPress. Y aunque no debería ser problema, como pasó por varios hostings y la creé cuando no tenía mucha idea de qué estaba haciendo, aquello daba problemas por todos lados, así que me olvidé del tema después de frustrarme. Que si fallaba el Endpoint de no se qué, que si el archivo patata tenía los permisos escacharraos, que si ahora el plugin no se cuantos no es compatible porque se ha roto el Transfuncionador del Contínuo\u0026hellip;\nHace un par de semanas llegó a mi Timeline la #websencilla y me llamó muchísimo la atención el concepto de volver atrás, de darle importancia al contenido, de hacer webs simples que carguen rápido sin cosas de terceros.\nPero yo estaba limitado por culpa de mi WordPress estropeado. Podría reinstalarlo y darle una vuelta, pero cada vez que pensaba en ponerme a ello, me daba una pereza horrorosa. Y entre otras cosas, la culpa la tenía el editor de bloques, nunca me terminé de acostumbrar, he de confesar que le he cogido una manía horrorosa. Sé que está por ahí el editor clásico en forma de plugin, pero en algún momento dice la teoría que dejará de estarlo. Lo curioso de esto es que llevo un par de webs de conocidos, y todas tienen el WordPress estupendo. Quizás, si no hubiera estado tan mal, podría haberme peleado con el editor de las narices. ¿Quién sabe?\nEl caso es que ayer terminé de plantearme cosas, y queriendo ahorrarme un servidor, como dije en otro post, y unos cuantos euros de paso, decidí hacer la migración a Hugo utilizando el tema Indiefeed.\nPero espera, que te vas por las ramas. ¿Qué es eso de la IndieWeb? Parafraseando y traduciendo de indieweb.org, La IndieWeb es una alternativa centrada en la gente a la \u0026ldquo;web corporativa\u0026rdquo;. Tu contenido es tuyo. Cuando publicas algo en la web, debería pertenecerte a ti, no a una empresa. Demasiadas compañías han cerrado y perdido todos los datos de sus usuarios. Uniéndote a la IndieWeb, tu contenido continúa siendo tuyo y estando bajo tu control.\nLa idea es que el centro de tu vida en la red sea tu página web, que te identifica en los servicios a los que quieras acceder. ¿Publicas un artículo sobre las bicicletas voladoras? Sin problema. Envías el enlace del artículo a distintos sitios y recibes las interacciones en tu web, independientemente del servicio que utilicen para ello. ¿Quieres responder? Sin problema también. Respondes desde tu página web y se propaga al sitio adecuado.\nMe mola la idea, ¿cómo empiezo? Lo primero que necesitarás es un dominio. Es lo que usarás para identificarte en la red, así que escoge uno que te represente.\nCuando lo tengas, puedes seguir esta guía interactiva (en inglés) para completar los tres niveles.\nParece complejo, pero salvo el tema de webmention se hace en nada. Por cierto, cuando la completes, siéntete libre de dejar por aquí una webmention.\nEn un futuro editaré la entrada para ampliarla con más detalles.\n¿Quieres comentarme algo? Utiliza el enlace para dejar una webmention o escríbeme en Mastodon.\n","date":"2024-01-14T10:15:29+01:00","site":"https://jesuspavonabian.es/","tags":null,"title":"#WebSencilla e IndieWeb: ¿Qué es? ¿Cómo participar?","uri":"https://jesuspavonabian.es/post/websencilla-indieweb-que-es-y-como-participar/"},{"author":{"about":"La tecnología debe estar al servicio de las personas.","domain":"https://jesuspavonabian.es","email":"correo@jesuspavonabian.es","image":null,"name":"Jesús Pavón Abián","nickname":"@jpavonabian"},"categories":null,"content":"Estoy harto. Harto de entrar a una web y que antes de poder empezar a navegar tenga que pelearme con el aviso de Cookies. Harto de la publicidad que no me deja navegar tranquilo, cada vez es más complicado saltarla con lector de pantallas. Harto de esas ventanitas que piden iniciar sesión con Google o con algún otro servicio. Harto de los acortadores de URLs que para llevarte al destino te machacan con no se cuantas webs intermedias, y eso si consigues llegar. Y aunque lo llevo viendo una semana como mucho, estoy harto de la nueva modalidad de negocio de los periódicos, consistente en cobrarte por rechazar las Cookies aquí más información. Así que he decidido poner remedio al tema, así de paso reduzco mi dependencia de google, aunque eso lo tocaré en otra entrada.\nFirefox al rescate Lo primero que he hecho ha sido cambiar a Firefox. Antes utilizaba Chrome y cambié incluso a Edge, pero finalmente he descubierto que estoy más cómodo en este navegador. Las últimas actualizaciones me llamaron muchísimo la atención. Me tiró mucho el poder copiar enlaces sin opciones de rastreo de forma nativa. Me daba un poco de pánico que no hubiera extensión de Bitwarden, pero tardé medio minuto en comprobar que había una.\nMinimizando el problema Además del PiHole y la VPN, me he hecho con unas cuantas extensiones para Firefox, por si algo se le escapa. Las he recopilado todas en una colección para que me sea más fácil a mi mismo encontrarlos en un futuro, y de paso, así puedo ir añadiendo los complementos o extensiones que vaya utilizando sin tener que actualizar esta entrada. Salvo Bitwarden y Tampermonkey son extensiones de instalar y olvidarse de ellas.\n¿Para qué Tampermonkey? Hay muchísimos scripts que permiten aumentar la privacidad o simplemente eliminar modales y cosas así, como este, que permite saltarse todos los enlaces acortados, aunque me consta que existen extensiones para ello (actualizaré la entrada y la colección cuando encuentre una en condiciones).\n¿Por qué AdNauseam? Por tocar las narices y fastidiar a quien me fastidia, solo y exclusivamente por esa razón. AdNauseam está desarrollado a partir de uBlock Origin, y su funcionamiento es casi idéntico. Bloquea los anuncios para que no te aparezcan. La diferencia es que realiza automáticamente clics en los anuncios que bloquea, generando registros de visitas en los sistemas de las redes de publicidad. Estos clics falsos fastidian los datos, pues no reflejan intereses reales de los usuarios, lo que impide que el rastreo sea efectivo.\nPor ahora los comentarios están desactivados, pero si quieres comentarme algo, podrás encontrarme en Mastodon.\n","date":"2024-01-13T22:36:31+01:00","site":"https://jesuspavonabian.es/","tags":null,"title":"¡Qué Hartura!","uri":"https://jesuspavonabian.es/post/que-hartura/"},{"author":{"about":"La tecnología debe estar al servicio de las personas.","domain":"https://jesuspavonabian.es","email":"correo@jesuspavonabian.es","image":null,"name":"Jesús Pavón Abián","nickname":"@jpavonabian"},"categories":["Informática"],"content":"Llevo un par de semanas utilizando un gestor de contraseñas. Y me ha cambiado la vida.\nEn un principio usaba el Llavero de Apple. Pero la sincronización con Windows mediante sus extensiones de navegador es simplemente horrorosa. Además, es un sistema cerrado, no da pie a hacer experimentos con él.\nPor suerte para mi, encontré Bitwarden y todos mis problemas se acabaron.\nEn un principio dudé. ¿Debía alojarlo en algún servidor utilizando Vaultwarden o debía pagar a Bitwarden? La decisión era difícil.\nSi alojaba Vaultwarden me evitaría pagar el premium de Bitwarden. Pero claro, eso significaría que tendría que contratar otro servidor. Podría aprovechar para instalar en él también Wallabag y matar dos pájaros de un tiro, pero estamos hablando de contraseñas y soy novato en esto. El más mínimo error de configuración en el servidor, una actualización mal hecha o cualquier otra cosa que se escapara a mis manos y tendría un problema gordísimo.\n¿Por qué Bitwarden y no otro gestor de contraseñas? El principal motivo no es otro que la accesibilidad. Me estuve informando y leí que tratan siempre que pueden hacer que sus aplicaciones cumplan el nivel AA de las WCAG.\nPor otro lado, es código libre y existe como he comentado más arriba Vaultwarden. Si me da por ahí y hago el cambio de servidores para ahorrar gastos, que tengo varias máquinas dispersas que podría unificar, podría salirme rentable autoalojar.\nExiste también bw, una aplicación que permite gestionar las contraseñas desde la línea de comandos. Esto me ha permitido alojar en la bóveda las claves ssh y tenerlas sincronizadas entre varios equipos. Acceder con bssh root@ip al servidor de turno desde uno de mis dos equipos es una pasada, haré una entrada explicando cómo he montado el invento.\nComo decía antes, no conozco ninguna de mis contraseñas. Y si la conozco, la voy cambiando. Bitwarden se integra bien con iOS y puede sustituir incluso a la aplicación autenticator. He acabado con mis problemas de sincronización de credenciales de un plumazo.\n","date":"2024-01-03T20:32:32+01:00","site":"https://jesuspavonabian.es/","tags":["Informática"],"title":"Adiós, contraseñas","uri":"https://jesuspavonabian.es/post/adioscontrasenyas/"},{"author":{"about":"La tecnología debe estar al servicio de las personas.","domain":"https://jesuspavonabian.es","email":"correo@jesuspavonabian.es","image":null,"name":"Jesús Pavón Abián","nickname":"@jpavonabian"},"categories":["Mastodon","S3"],"content":"Llevo un tiempo administrando la instancia de Mastodon Universo alterno (se abre en una nueva ventana). Al principio, todo iba bien. hasta que el disco duro comenzó a llenarse. Los usuarios subían contenidos y el contenido de las instancias federadas se cacheaba, lo que ocasionó que tuviese que limpiar la caché y varios elementos una vez al día.\nObviamente esto no era óptimo, porque muchos usuarios perdían notificaciones, había contenido que desaparecía con muchísima rapidez\u0026hellip; Un jaleo horroroso. Como solución temporal servía, pero había que darle una vuelta al tema.\nAsí pues decidí dejar de complicarme la vida. Ampliar el servidor no era una opción, se me iba de precio con una facilidad pasmosa, además de de tener que ir ampliando si la instancia crecía. Por suerte, existen los almacenamientos de objetos S3.\nLo primero que tuve que hacer fue una búsqueda de cuál me interesaba más. Al final, tras mucho investigar, me decidí por Scaleway. ¿Por qué Scaleway? Porque es barato, cobran en euro y porque sus centros de datos están en Europa.\nComo la información que encontré estaba bastante difuminada y no hay nada en español con este servicio, me he decidido a escribir un tutorial unificando los trozos de información que fui recogiendo de aquí y de allá. Vamos al lío.\nRegistro en Scaleway Lo primero que necesitaremos será crearnos una cuenta en Scaleway (se abre en una nueva ventana). el registro no es complicado; lo más difícil será verificar el método de pago, que requerirá introducir un código que nos llegará al banco al hacer un pago de un euro que luego nos devolverán.\nCreando el Object Storage Tras iniciar sesión y verificar nuestro método de pago, tenemos que crear un Object Storage. allí será donde enviaremos los archivos de nuestra instancia y donde se subirán los nuevos.\nPara ello, pulsamos el botón Storage y el enlace Object Storage.\nCrearlo es sencillo; escogemos la región más cercana al servidor de la instancia y nos aseguramos de que el bucket sea privado, pues no queremos que google u otros rastreadores puedan acceder al listado de medios de nuestra instancia, pero sí queremos que se puedan acceder a los archivos mediante URLs específicas.\nImportante: Tenemos que tener cuidado con qué nombre le ponemos al Bucket. No podemos usar puntos. Mi.instancia no sería válido, nos dará problemas a futuro. Por el contrario, mi-instancia sí que lo es. Mi consejo es que lo llameis como el nombre de vuestra instancia. Por ejemplo en mi caso el nombre es, sin las comillas, \u0026ldquo;universoalterno\u0026rdquo;.\nUna vez creado, nos aparecerá la información del Bucket. Deberemos guardarla para tenerla a mano.\nConfigurando un proxy Nginx Esto es opcional, pero es altamente recomendable para ahorrar dinero. básicamente, lo que hacemos aquí es cachear el contenido para que no tengamos que hacerle una petición al Bucket cada vez que queramos acceder a él y podamos ahorrar tráfico. Para ello, el procedimiento es el siguiente:\nEn primer lugar, necesitamos crear un registro A en la zona DNS de nuestro dominio para añadir un subdominio. A ese subdominio irán las peticiones de multimedia. Deberemos apuntar ese registro a la máquina que contiene la instancia. En mi caso he creado un media.universoalterno.es que apunta a la misma ip que mst.universoalterno.es.\nhecho esto, deberemos configurar el proxy Nginx. Accedemos a la máquina que contiene la instancia y tecleamos sin las comillas (con sudo delante si no somos root) \u0026ldquo;nano /etc/nginx/sites-available/media\u0026rdquo; para entrar al editor de textos y crear un archivo nuevo. El contenido será el siguiente:\nserver { listen 443 ssl http2; listen [::]:443 ssl http2; server_name files.example.com; root /var/www/html; keepalive_timeout 30; location = / { index index.html; } location / { try_files $uri @s3; } set $s3_backend 'https://YOUR_BUCKET_NAME.YOUR_S3_HOSTNAME'; location @s3 { limit_except GET { deny all; } resolver 8.8.8.8; proxy_set_header Host YOUR_BUCKET_NAME.YOUR_S3_HOSTNAME; proxy_set_header Connection ''; proxy_set_header Authorization ''; proxy_hide_header Set-Cookie; proxy_hide_header 'Access-Control-Allow-Origin'; proxy_hide_header 'Access-Control-Allow-Methods'; proxy_hide_header 'Access-Control-Allow-Headers'; proxy_hide_header x-amz-id-2; proxy_hide_header x-amz-request-id; proxy_hide_header x-amz-meta-server-side-encryption; proxy_hide_header x-amz-server-side-encryption; proxy_hide_header x-amz-bucket-region; proxy_hide_header x-amzn-requestid; proxy_ignore_headers Set-Cookie; proxy_pass $s3_backend$uri; proxy_intercept_errors off; proxy_cache CACHE; proxy_cache_valid 200 48h; proxy_cache_use_stale error timeout updating http_500 http_502 http_503 http_504; proxy_cache_lock on; expires 1y; add_header Cache-Control public; add_header 'Access-Control-Allow-Origin' '*'; add_header X-Cache-Status $upstream_cache_status; add_header X-Content-Type-Options nosniff; add_header Content-Security-Policy \u0026quot;default-src 'none'; form-action 'none'\u0026quot;; } }\nTenemos que reemplazar files.example.com por nuestro dominio (en mi caso media.universoalterno.es), YOUR_BUCKET_NAME por el nombre de nuestro bucket (en mi caso universoalterno), YOUR_S3_HOSTNAME por el host de nuestro bucket (lo conseguimos cuando creamos el Bucket, es lo que viene después del punto que va después del nombre).\nGuardamos el archivo con ctrl + x y respondiendo y y generamos un enlace al archivo con el siguiente comando (sin comillas) \u0026ldquo;ln -s /etc/nginx/sites-available/media /etc/nginx/sites-enabled/\u0026rdquo;.\nCasi terminamos con esto. Lo siguiente que tenemos que hacer es reiniciar el servidor web y generar un certificado SSL, cosa que haremos con \u0026ldquo;systemctl reload nginx\u0026rdquo;, \u0026ldquo;certbot \u0026ndash;nginx -d files.example.com\u0026rdquo; (Tenemos que reemplazar files.example.com por nuestro subdominio) y otra vez \u0026ldquo;systemctl reload nginx\u0026rdquo; para que pille los cambios del certificado.\nSubiendo datos al Bucket y configurando Mastodon Casi lo tenemos hecho. solo nos falta decirle a Mastodon donde debe ir a buscar los datos y subir los que tenemos en el servidor al Bucket. Para ello, deberemos conseguir las claves de acceso para nuestro Bucket. En Scaleway pulsamos en el avatar (una imagen sin etiquetar si usas lector de pantallas) y después pulsamos en Manage Identity and Access with IAM.\nUna vez hecho esto, pulsamos en la pestaña api-keys y luego en Generate API key.\nSeguimos las instrucciones (no es complicado) y guardamos la clave de acceso y la clave secreta en un lugar seguro.\nTeniendo estos datos, podemos configurar nuestro mastodon. en primer lugar, abriremos otra sesión a parte para ir subiendo los datos mientras tanto.\nSubir los datos no es difícil. Nos logueamos como usuario mastodon (su mastodon) y nos vamos al directorio live, que suele estar en /home/mastodon/live al menos que lo tengas en otro lado por tener una configuración personalizada. Una vez allí, instalamos awscli con \u0026ldquo;pip install awscli\u0026rdquo;.\nLo siguiente que tenemos que hacer es configurarlo, así que ejecutamos aws configure y seguimos los pasos:\nIngresamos la clave conforme nos las va pidiendo. en región, si escogimos parís ponemos \u0026ldquo;fr-par\u0026rdquo; y si escogimos Ámsterdam \u0026ldquo;nl-ams\u0026rdquo; (sin las comillas). En la pregunta de output format nos limitamos a pulsar enter. Casi estamos listos. Podríamos intentar subir todo nuestro contenido tal cual, pero es preferible hacer algo de limpieza primero, así que ejecutamos los siguientes comandos, sin comillas y esperando que termine de ejecutarse el primero para ejecutar el segundo. \u0026ldquo;RAILS_ENV=production bin/tootctl media remove\u0026rdquo; y \u0026ldquo;RAILS_ENV=production bin/tootctl media remove-orphans\u0026rdquo;.\nYa está todo configurado y estamos listos para subir nuestro contenido multimedia. en teoría, si hemos seguido bien el artículo, estaremos en /home/mastodon/live y podremos proceder. Para ello, tecleamos el siguiente comando (adáptalo con tus datos): aws s3 sync \u0026ndash;acl public-read public/system/ s3://universoalterno \u0026ndash;endpoint=https://s3.fr-par.scw.cloud\nEsto puede tardar (y lo hará), así que dejamos esa ventana abierta y nos ponemos con el resto de configuraciones: En /home/mastodon/live realizamos lo siguiente:\nen primer lugar y para evitar sustos, hacemos una copia del archivo .env.production de la siguiente forma: cp .env.production copia.env.production\nA continuación añadimos el siguiente contenido (reemplaza los datos necesarios) al final del archivo .env.production: nano .env.production\nS3_ENABLED=true S3_BUCKET=universoalterno AWS_ACCESS_KEY_ID=tu_clave AWS_SECRET_ACCESS_KEY=tu_clave_secreta S3_ALIAS_HOST=media.universoalterno.es S3_HOSTNAME=media.universoalterno.es S3_REGION=fr-par S3_ENDPOINT=https://s3.fr-par.scw.cloud\nGuardamos, salimos del usuario mastodon con \u0026ldquo;exit\u0026rdquo; y reiniciamos los servicios: \u0026ldquo;systemctl restart mastodon-sidekiq\u0026rdquo; y \u0026ldquo;systemctl reload mastodon-web\u0026rdquo;.\n¡Listo! A partir de ahora, los datos irán a parar a nuestro Bucket y podremos dejar de sufrir por el espacio en disco del servidor.\nEs probable que mientras toqueteábamos configuraciones alguien hiciera algo y sus cambios quedaran en el limbo. No pasa nada. Cuando termine de copiar los archivos, vuelve a ejecutar el comando para subirlos todos.\n","date":"2023-12-12T15:15:42+01:00","site":"https://jesuspavonabian.es/","tags":["Mastodon","S3"],"title":"añadir S3 a una instancia de Mastodon y migrar sus datos","uri":"https://jesuspavonabian.es/post/anadir-s3-a-una-instancia-de-mastodon-y-migrar-sus-datos/"},{"author":{"about":"La tecnología debe estar al servicio de las personas.","domain":"https://jesuspavonabian.es","email":"correo@jesuspavonabian.es","image":null,"name":"Jesús Pavón Abián","nickname":"@jpavonabian"},"categories":null,"content":"El título de esta entrada suena a Clickbait, ya lo sé. Pero tras probarlo he comprobado que es cierto, dns0 cumple lo que promete. hacer la navegación por internet más segura.\n¿Qué hace exactamente? Resumiendo mucho, bloquea dominios maliciosos e impide que entres a ellos.\nPor ejemplo, esta mañana me llegó un SMS de estafa en el que ponía que mi paquete estaba retenido porque la dirección estaba incompleta. en ese mensajito venía un enlace la mar de mono para recopilar datos. Por supuesto, la dirección no tenía nada que ver con Correos. Por hacer la prueba lo pulsé y DNS0 entró en acción. Al estar el dominio en su lista negra lo bloqueó, impidiendo que pasara algo grabe.\nPero esto no es todo. DNS0 no solo permite bloquear dominios maliciosos. Permite activar una especie de control parental para hacer más segura la navegación para niños bloqueando dominios de adultos o webs de citas, entre otras opciones.\n¿Cómo lo configuro? Utilizar este servicio gratuito es sencillo. Solo tienes que utilizar uno de sus servidores DNS para gestionar las peticiones que se hacen a internet.\nBasta con acceder a la web de dns0 y seguir sus instrucciones para configurar sus DNS en nuestros dispositivos.\nLo que yo he hecho ha sido configurar las DNS de la VPN y del Pi-hole utilizando las instrucciones para configurar las DNS en un Router.\nA partir de ahora, siempre que navegue utilizando la VPN o desde la red local de casa estaré bastante protejido.\n","date":"2023-12-12T15:15:42+01:00","site":"https://jesuspavonabian.es/","tags":null,"title":"El DNS público europeo que hace tu Internet más seguro","uri":"https://jesuspavonabian.es/post/dnsseguroeuropeo/"},{"author":{"about":"La tecnología debe estar al servicio de las personas.","domain":"https://jesuspavonabian.es","email":"correo@jesuspavonabian.es","image":null,"name":"Jesús Pavón Abián","nickname":"@jpavonabian"},"categories":["VPN","PiHole","VPS"],"content":"Vamos con otro tutorial. Esta vez sobre cómo montar una VPN más Pihole para eliminar los anuncios de la red.\n¿Cuál es el punto? Odio los anuncios. De verdad, me ponen de una mala leche increíble, tengo una guerra eterna contra ellos. Desde que instalé Pihole los hice medio desaparecer, pero no es suficiente. ¡Si me voy de casa los sigo viendo!\nAsí que nada mejor que montar una VPN a la cual poder conectarme. Así, de paso, tengo acceso a todos los cacharros que están en mi red de casa desde cualquier lado.\n¡Eh, yo también quiero! ¿Qué necesito? Apunta, necesitarás lo siguiente:\nUn ordenador fijo con Linux. Una raspberry pi te hace el apaño si no tienes uno. Necesitamos algo conectado 24/7 al router de casa. Un VPS también puede valer si tienes suficiente tráfico. Una velocidad medio en condiciones. Abrir puertos en el router si no usas VPS. Vale, tengo todo, ¡al lío! Venga, vamos. Lo primero, necesitamos Debian o Ubuntu. Yo prefiero Debian, Raspbian en mi caso. Tras instalarlo, usaremos Raspbian como referencia, pero sirve igual para otros sistemas, configuraremos la IP estática de la máquina. Necesitamos asegurarnos de que no nos da la lata el cambio de IP, así que comprobamos en nuestro router cuál es el rango de DHCP y le metemos una que esté fuera del rango. En mi caso, como 192.168.1.1 es una IP muy común y al acceder a cacharros desde fuera me daba conflicto porque fuera también hay 192.168.1.1, decidí cambiarla a 10.0.0.1 y tener el DHCP empezando en 10.0.0.33. Con esto me aseguro de que los cacharros conectados a la red tengan 10.0.0.34, 10.0.0.35, etc., y que todo lo que meta por debajo de 33 no va a entrar en conflicto. PiHole nos configura la IP estática el solito cuando se instala. Una vez nuestro sistema está instalado y configurado haremos lo siguiente:\nEntrar como root. Si no podemos: sudo su Actualizar repositorios: apt update Actualizar el sistema: apt upgrade Instalar curl si no lo tenemos: apt install curl Instalar PiHole: curl -sSL https://install.pi-hole.net | bash Nos saldrá un asistente muy chulo. Si usas DHCP en el router, decidle que no lo active. Nos preguntará varias cosas, entre ellas si queremos dejar la IP actual como estática. Decidle que sí. También nos dejará escoger DNS, es un instalador intuitivo. Cuando os pida DNS, podéis decirle que 8.8.8.8 y 1.1.1.1 o algún otro servicio de esos chulos de DNS. Os dará los datos de acceso por web para que podáis tocar cosas. Aunque ya por cómo viene por defecto se cepilla suficientes anuncios, yo he metido alguna lista más. Google puede ayudar en este caso.\nSi queremos, cambiamos la contraseña de PiHole: pihole -a -p\nCambiamos las DNS del router a la IP de nuestro cacharro. Cada router es un mundo, así que ahí no me meto. Reiniciamos el cacharro con sudo reboot y nos mentalizamos para instalar Wireguard. Para ello usaremos pivpn, un script que nos facilita mucho el trabajo. Asumiremos que tenemos un usuario llamado dherhion.\nEn primer lugar nos vamos a su home, para ello teclearemos lo siguiente:\ncd /home/dherhion/\nAhora procedemos a actualizar los repositorios, sé que lo hemos hecho antes, pero bueno:\nsudo apt update\nContinuamos por fin instalando Wireguard:\nsudo curl -L https://install.pivpn.io | bash\nCuando pregunte qué VPN queremos, escogemos Wireguard. Cuando nos pregunte si queremos usar IP o DNS, escogemos DNS. Sé que no hemos configurado nada todavía, pero eso se hace luego. Nos pedirá un dominio. Yo uso duckdns con un cron y lo explicaré más adelante, así que dherhion.duckdns.org en mi caso. Podéis usar noip, zapto o cualquiera de los gratuitos. Hay routers que permiten actualizar la IP automáticamente. El instalador ahora detectará que tenemos PiHole instalado y nos preguntará si queremos usarla en la VPN. Le decimos que sí, obviamente.\nUna vez el asistente finalice, tenemos que hacer que la VPN se inicie con el sistema:\nsudo systemctl enable wg-quick@wg0.service\nsudo systemctl start wg-quick@wg0.service\nCasi terminamos. Lo siguiente que tenemos que hacer es abrir el puerto 51820 en el router y configurar el dominio.\nActualización: Existe este script que ahorra todo el proceso, no necesita usar pivpn y crea los servicios automáticamente. Viene también con un script para eliminar y añadir usuarios a la VPN.\nCrear usuarios, configurar dominio dinámico y conectar Para continuar, vamos a crear dos usuarios y conectarnos a la VPN. Sigue los pasos a continuación:\nUsa el comando pivpn -a para crear un usuario llamado \u0026ldquo;pepeordenador\u0026rdquo; y otro llamado \u0026ldquo;pepemovil\u0026rdquo;. Si prefieres ahorrarte preguntas, puedes utilizar pivpn -a -n pepeordenador. Esto creará perfiles de usuario en la carpeta \u0026ldquo;configs\u0026rdquo;. Deberías tener los archivos \u0026ldquo;pepeordenador.conf\u0026rdquo; y \u0026ldquo;pepemovil.conf\u0026rdquo; listos para usar. Ahora, vamos a configurar el DNS antes de generar el QR para el usuario \u0026ldquo;pepemovil\u0026rdquo;. Regístrate en duckdns.org y crea una cuenta. Luego, añade un dominio. Para que la ip a la que apunta el dominio se actualice sola, añade la siguiente línea al crontab utilizando el comando crontab -e: */1 * * * * /home/dherhion/actualizarip.sh \u0026gt;/dev/null 2\u0026gt;\u0026amp;1\nCrea un archivo llamado \u0026ldquo;actualizarip.sh\u0026rdquo; en la ruta \u0026ldquo;/home/dherhion/\u0026rdquo; utilizando el comando nano /home/dherhion/actualizarip.sh y añade el siguiente contenido:\necho url=\u0026quot;https://www.duckdns.org/update?domains=dherhion\u0026amp;token=tu_token\u0026amp;ip=\u0026quot; | curl -k -o ~/duckdns/duck.log -K -\nReemplaza \u0026ldquo;dherhion\u0026rdquo; y \u0026ldquo;tu_token\u0026rdquo; por los valores correspondientes. Luego, ejecuta chmod +x actualizarip.sh para darle permisos de ejecución al script.\n¿Cómo probar si funciona? Casi lo tenemos. ¡Probemos a conectar! Explicaré cómo hacerlo desde un móvil, pero conectar desde Windows, Mac o Linux no es difícil, solo tienes que importar el archivo .conf que se genera en configs.\nDescarga la aplicación Wireguard desde Google Play Store o App Store. Abre la aplicación y selecciona la opción para escanear un código QR. Maximiza la pantalla de la terminal en tu dispositivo. Ejecuta el comando pivpn -qr. Selecciona el perfil correspondiente al usuario \u0026ldquo;pepemovil\u0026rdquo;. En el móvil, agrega un nuevo túnel utilizando la configuración generada. ¡Listo! Desconecta la conexión Wi-Fi y activa el nuevo túnel creado. Navega durante unos minutos y luego utiliza el comando pivpn -c en la terminal de tu ordenador para ver los dispositivos conectados. Si todo está configurado correctamente, deberías poder acceder al panel de PiHole cuando te conectes a la VPN. Bonus: Acceder a los dispositivos de la red como si estuvieras conectado localmente Para acceder a los dispositivos de la red como si estuvieras conectado localmente, sigue estos pasos:\nsudo nano /etc/sysctl.conf\nDescomenta la línea:\nnet.ipv4.ip_forward = 1\nGuarda los cambios con Ctrl + X. Luego, ejecuta el comando ip route list default para obtener la interfaz de red.\nAbre el archivo de configuración de Wireguard utilizando el comando:\nsudo nano /etc/wireguard/wg0.conf\nAgrega las siguientes líneas debajo de la configuración existente en la sección \u0026ldquo;ListenPort\u0026rdquo;, asegurándote de no duplicar líneas:\nSaveConfig = true\nPostUp = iptables -t nat -I POSTROUTING -o eth0 -j MASQUERADE\nPreDown = iptables -t nat -D POSTROUTING -o eth0 -j MASQUERADE\nGuarda los cambios con Ctrl + X. Finalmente, reinicia el sistema con sudo reboot.\n¡Listo! Ahora puedes acceder a los dispositivos de tu red como si estuvieras conectado localmente.\nP.D.: Dherhion.duckdns.org no existe.\n","date":"2023-06-23T00:00:00Z","site":"https://jesuspavonabian.es/","tags":["VPN","PiHole","VPS"],"title":"Crear una VPN con Wireguard más PiHole para olvidarnos de los anuncios y acceder a nuestras cosas desde cualquier lugar","uri":"https://jesuspavonabian.es/post/crear-una-vpn-con-wireguard-mas-pihole-para-olvidarnos-de-los-anuncios-y-acceder-a-nuestras-cosas-desde-cualquier-lugar/"},{"author":{"about":"La tecnología debe estar al servicio de las personas.","domain":"https://jesuspavonabian.es","email":"correo@jesuspavonabian.es","image":null,"name":"Jesús Pavón Abián","nickname":"@jpavonabian"},"categories":null,"content":"soy una persona que cuando tiene que ir a un sitio apunta los recorridos para no olvidarse. Concienzudamente, además. Cualquier mínimo detalle, por mínimo que sea, me sirve. Sobre todo lo hago si es un recorrido que haré pocas veces o que haré muchas veces, pero espaciadas en el tiempo.\nEn un principio utilizaba la aplicación de Notas de Apple, pero llegué a la conclusión de que necesitaba algo más. Los recorridos se me quedaban desordenados, tenía dificultades para leer las notas en medio de la calle\u0026hellip; No era práctico\nAsí que decidí crear mi propia aplicación en seguida me topé con el primer problema: Necesitaba aprender Swift y SwiftUI. Un curso de 100 días lo solucionó.\nen principio parecía fácil. Una base de datos para apuntar los recorridos, un par de botones\u0026hellip; No pintaba demasiado complicado.\nY en efecto, no es demasiado complicado. el problema fue que yo me empeñé en complicarlo.\nCuando tuve algo que funcionaba, lo comenté con un par de colegas y me dijeron algo como\u0026hellip; \u0026ldquo;La idea mola, pero le falta algo que no se qué es\u0026rdquo;. Y ahí quedó la cosa hasta que hablé con este señor (abre en una nueva ventana), que además de recordarme reglas básicas de programación que no había seguido, me dio un par de ideas para simplificar el código y añadirle alguna cosilla más.\nY aquello quedó ahí. Tenía que rehacerlo todo y me daba una pereza horrorosa, y eso que el primer beneficiado de la aplicación soy yo.\nFinalmente me decidí. Borré todo lo que había hecho, aunque algo podría haber reutilizado y creé un nuevo repositorio privado.\nIba a empezar de cero, y lo iba a hacer bien. la primera regla era tener un código limpio. La segunda era comentar el código, de forma que cuando lo tuviera que mirar más adelante no tuviera que perder tiempo releyéndolo para saber qué hacía.\nY así empecé a programar. Y salió el chat de GPT.\nY cuando le pregunté por curiosidad una cosa sobre mi código, me encontró errores en los que yo no había caído.\nAsí que tocó reescribir la aplicación otra vez. Mismo proceso, borrar y volver a programar. Podría haberlo intentado arreglar, pero el código estaba volviéndose demasiado engorroso.\nDicen que a la tercera va la vencida y tienen razón.\nahora todo está en su sitio, y modificar una cosa no me rompe otras dos.\nCada función hace lo que tiene que hacer, y no depende de otra. Los nombres de variables son claros y la interfaz se limita a mostrar cosas por pantalla, dejando la lógica de la aplicación al controlador.\nPor ejemplo, una de las funciones de la aplicación es, una vez guardado un recorrido, poderlo compartir con alguien. Para ello, se envía un json a la persona, y la persona ya lo importa en su aplicación.\nPues todo está separado. El botón por su lado, el crear el json por otro y el acceso al recorrido por otro.\nfunc obtenerJSONRecorrido(recorrido: Recorrido) -\u0026gt; String { let encoder = JSONEncoder() if let data = try? encoder.encode(recorrido), let jsonString = String(data: data, encoding: .utf8) { return jsonString } else { return \u0026quot;\u0026quot; } }\nA la aplicación todavía le falta para poderse lanzar, aunque he de decir que la he probado y cumple con lo que yo necesito.\nPuedes añadir recorridos. Puedes editarlos desde una sola pantalla. Puedes mostrar los detalles del recorrido e ir avanzando paso por paso con dos botones, siguiente y anterior. Puedes compartirlos con alguien usando tu app favorita. Me falta por revisar la parte visual, que sospecho que la aplicación es bastante mejorable en ese aspecto. Por otro lado, me gustaría cambiar algunas cosillas del código, que pese a que me he esforzado, no le vendría mal que le refactorizara algunas cosillas. ¡Pronto daré más información! Por cierto, como curiosidad, del diseño para probar la app, se ha encargado el chat de gpt. He tenido que adaptar todo lo que me ha enviado como respuesta, pero facilita muchísimo la vida cuando sabes qué estás haciendo.\n","date":"2023-01-02T00:00:00Z","site":"https://jesuspavonabian.es/","tags":null,"title":"Tu guiador: Un proyecto nuevo","uri":"https://jesuspavonabian.es/post/tu-guiador-un-proyecto-nuevo/"},{"author":{"about":"La tecnología debe estar al servicio de las personas.","domain":"https://jesuspavonabian.es","email":"correo@jesuspavonabian.es","image":null,"name":"Jesús Pavón Abián","nickname":"@jpavonabian"},"categories":null,"content":"Hoy quiero escribir sobre domótica. Ya saben ustedes, eso de las casas inteligentes. Cuando yo era pequeño, mi madre me decía\u0026hellip; -Cuando tengas tu casa y vaya a visitarte, el portero te dirá\u0026hellip; \u0026ldquo;Ya está aquí la pesá de tu madre, ¿le abro?\u0026rdquo; Al principio me hacía gracia. ¿Cómo iba a saber el telefonillo quién quería entrar? Os hablo de la época de los primeros teléfonos móviles y de las primeras conexiones a internet. ¿Soy muy viejo si recuerdo conectarme con un modem a 56KBPS y desconectarme porque alguien levantaba el teléfono? Años después, descubrí que mi madre tenía razón, actualmente es más o menos posible hacer algo así, aunque no tengo yo muy claro que sea legal guardarte una foto de alguien para identificarle o poner una cámara en la calle. El caso es que yo llevaba queriendo domotizar la casa desde hace tiempo. vivo de alquiler, así que quería cosas que pudiera llevarme a otra casa sin mucha complicación. Qué narices. Por querer, quiero interruptores inteligentes, bombillas inteligentes con un par de sensores de movimiento y un aire acondicionado inteligente que se active dependiendo de lo que arrojen un par de sensores de temperatura. Pero estando de alquiler es un poco complicado. Hace un par de semanas me avisaron de que me convocaban para el curso de perro guía. Y además de la ilusión y esas cosas, que me voy a ahorrar comentar porque hay mil entradas en mil Blogs describiendo la experiencia, se me encendió la bombilla. Ya tenía la excusa ideal para aprovechar para domotizar. Lo primero el robot de limpieza. Sabemos que un perro de estos suelta pelo para dar y regalar, y yo no se a ustedes, pero me gusta tener la casa limpia. Escogí uno de los robots que había en oferta. nada mejor para ello que tener a Salva de amigo. el cabrón es como un traficante de drogas pero con los cacharros y la comida. Encuentra ofertas con una facilidad pasmosa. en concreto, este cacharrito.\nPone que es compatible con Alexa, pero yo no conseguí que el Echo lo detectara. De accesibilidad no va nada mal, si quitamos el hecho de que no podemos programar la limpieza sin ayuda. Pero ese problema se soluciona con HomeBridge para hacerlo compatible con HomeKit, pues puedes programar una automatización desde la aplicación de casa de Apple y asunto solucionado. Haré una entrada explicando cómo configurar HomeBridge y cómo hacer el cacharro compatible, porque hecho uno es fácil hacer el resto si hace falta. Lo siguiente que he hecho inteligente ha sido la puerta de la nevera. Parecerá una estupidez, pero hay veces que se queda abierta o que se abre sola, y tener una notificación en el teléfono y el HomePod pegando berridos ayuda a solucionar ese detallito. Adiós, acumulación de hielo en la nevera. para ello he utilizado el sensor de puertas y ventanas de Aqara. Con su correspondiente Hub, por supuesto. En este caso es bueno, barato, compatible con HomeKit sin hacer tonterías y accesible sin morir en el intento. Prometo hacer la entrada de cómo configurarlos uno de estos días, que es fácil hacerlo mal y tirarte una hora dándole vueltas al sensor para poner las dos partes en su sitio.\nencontrar el Hub ha sido una pesadilla. Tras pelearme con Amazon y un vendedor que pasaba olímpicamente de enviarlo, compré a una tienda española el Aqara M2 Hub. Dos días tardó, un servicio impecable. Y lo mejor es que casi todo lo de Aqara es bastante accesible, así que en tema sensores, es difícil equivocarse por lo que me han contado. ¿Planes futuros? si me quedo en esta casa, comprar un dedo domótico que pulse el botón del aire acondicionado cuando la temperatura que arroje un sensor sea inferior a 20 grados. sí, existe.\nPor supuesto, iré ampliando esta entrada con toda cosa domótica que caiga en mis manos. ¡nos leemos pronto! Este artículo posee enlaces de amazon Afiliados. Recibo comisión por cada compra.\n","date":"2022-02-25T00:00:00Z","site":"https://jesuspavonabian.es/","tags":null,"title":"domótica accesible","uri":"https://jesuspavonabian.es/post/domotica-accesible/"},{"author":{"about":"La tecnología debe estar al servicio de las personas.","domain":"https://jesuspavonabian.es","email":"correo@jesuspavonabian.es","image":null,"name":"Jesús Pavón Abián","nickname":"@jpavonabian"},"categories":null,"content":"Soy ciego y quiero montar mi canal de Youtube, Twitch y demás, pues considero que tengo cosas que mostrarle al mundo. ¿Se puede sin morir en el intento? ¡He buscado en Google y me he quedado igual!\nClaro que se puede, aunque he de decir que el resultado no será el adecuado sin un poco de ayuda visual. Pero al menos, si me lees, harás algo menos el ridículo. ¡Adiós, transmisiones con pantalla negra! Os dejo por aquí a modo de guía rápida (o de recolección de recursos) todo lo necesario para empezar.\nEs cierto que hay bastante información (no estoy escribiendo nada nuevo, la hay incluso repetida), pero suele estar en vídeos o en audiotutoriales. Y voy a ser franco, muchas veces acaban con mi paciencia. Prefiero lo escrito, que puedo leer cuantas veces necesite y sin complicarme la existencia. Iré actualizando esta entrada o creando otras nuevas con los recursos que me vaya encontrando por la red. Sin más, vamos a lo que nos interesa.\nEquipamiento necesario Para dar inicio a tu aventura en el streaming necesitarás:\nUn ordenador con Windows 10 como mínimo, una buena tarjeta gráfica y bastante memoria RAM. La última versión de NVDA (Abre en una nueva ventana). Podrías usar JAWS o Narrador, pero la forma más fiable de asegurar que todo funcione bien la he encontrado con este lector de pantallas. Necesitarás saber manejar el navegador de objetos de NVDA, así como el OCR que viene integrado. Si no sabes, antes de seguir adelante con esto, es un buen momento para aprender. La última versión de OBS (abre en una nueva ventana). El complemento de NVDA para OBS Studio (abre en una nueva ventana) (opcional, yo no lo utilizo). Una cuenta en Twitch y/o YouTube. Si usas Twitch o YouTube, descarga VeTube (abre en una nueva ventana) para leer chats. Comenzando Bien, ya tenemos todo lo que necesitamos. Podemos continuar.\nLo primero que tenemos que hacer es instalar OBS Studio. No me voy a detener aquí pues es una instalación bastante sencilla.\nCuando lo abramos por primera vez, nos saldrá un asistente de configuración. hay quien prefiere saltarlo y configurarlo todo luego desde los ajustes, pero si se tiene claro para qué se desea el programa, es bastante útil, pues acaba ahorrando más de un dolor de cabeza. ¡Aprovéchalo!\nLo siguiente que tenemos que hacer, una vez abierto el programa, es ignorar la ventana de Twitch o Youtube, si es que nos sale alguna. Usa el navegador de objetos para desplazarte a la ventana del programa y mueve el foco a dicha ventana para continuar.\nPor lo general, OBS nos pilla algunos ajustes ya por defecto. Pero no está demás ir a la barra de menús con alt y revisar en los ajustes. Por defecto, nos capturará el audio del escritorio (todo lo que se escuche por nuestros altavoces o auriculares) y el micrófono predeterminado.\nComencemos. Lo primero que tenemos que hacer es, si no lo hemos hecho en el asistente de configuración, configurar el destino de nuestra transmisión. En ajuste tienes todas las opciones, revísalas bien y sigue las instrucciones.\nLo siguiente que haremos será crear tres escenas que incluirán varias fuentes. Nos detendremos un momento aquí para explicar el concepto de forma bastante rápida.\nUna escena es una colección de fuentes que pueden o no mostrarse.\nUna fuente es, como su nombre indica, una fuente de contenido. Puede ser desde nuestra pantalla del ordenador hasta un archivo multimedia, pasando incluso por lo que nos devuelva un navegador web. ¡Anímate a buscar en google para más información!\nEn mi caso particular, yo utilizo tres escenas. Una llamada cara, otra llamada pantalla y otra llamada cámara y pantalla. El contenido de cada una son las siguientes fuentes, sin contar alertas y cosas más avanzadas que pueden añadirse:\nCara Contiene una única fuente que ocupa todo el tamaño de la pantalla. para crearla he seguido los siguientes pasos, una vez en la ventana principal de OBS.\nCon navegador de objetos me he desplazado a la ventana de escenas. He accedido a la barra de herramientas y he pulsado en el botón agregar. En el cuadro de edición para darle un nombre he escrito cara y he pulsado enter. A continuación, de vuelta en la ventana principal de OBS, he pulsado ctrl+n para añadir una vuente y he seleccionado una fuente de captura de dispositivo de vídeo. He seguido el asistente, le he puesto de nombre cámara para fuente cara y he seleccionado mi cámara, no he tocado nada más. para acabar, he seleccionado la fuente con control 1 y le he dado a CTRL + f para ajustarla a la pantalla. `\nPantalla Esta escena consiste exactamente en hacer lo mismo que la anterior, pero cambiando la fuente de dispositivo de captura de vídeo por la de captura de pantalla. Ponle un nombre descriptivo y deja el resto de ajustes tal cuál están. ¡No olvides pulsar cuando termines CTRL+f para ajustarla a toda la pantalla!\nCara y pantalla Esta escena es una mezcla de las dos anteriores. Cuidado que tiene su aquel. Creé una que se llamó pantalla y cara y seguí estas instrucciones.\nEn primer lugar, pulsé CTRL+n para añadir una fuente captura de pantalla. Cuando la tuve, no pulsé CTRL+f, pues no queremos ajustarla a la pantalla, necesitamos que la siguiente se superponga y quede más o menos bien. Para acabar, añadí la fuente de captura de dispositivo de vídeo, donde seleccioné mi cámara. Por alguna razón que tiene su lógica pero que yo no puedo explicaros con exactitud (cosas de no ver), hay que seguir dicho orden para que ambas fuentes se vean.\nEn lo que respecta al audio, hay una nueva fuente disponible que permite capturar el audio de una aplicación específica, lo cual es útil si no deseas capturar todo el audio del sistema.\nAtajos de teclado Una de las cosas buenas que tiene OBS es que permite personalizar los atajos de teclado para hacer la mayoría de sus acciones de forma rápida. Ve a los ajustes y explora la parte de teclado. El navegador de objetos te será útil aquí. Una de las primeras cosas que añadí a los atajos fue el cambiar entre escenas. Shift f1 me lleva a la escena de solo pantalla, shift f2 me lleva a la escena de solo cámara y shift f3 me lleva a la de cámara y pantalla. Es muy útil si estás transmitiendo y necesitas cambiar rápidamente.\nTruco: Con tabulador puedes moverte entre cuadros de edición y botones, Usa la convinación de teclas para mover el navegador de objetos hacia atrás para ver en qué opción estás, pues esa parte no termina de ir bien con NVDA. si no te consigues aclarar, escribe un comentario y lo explico con más detalle.\nPantalla en negro Hay una última cosa que me gustaría comentar en este artículo. La pantalla en negro. Es una comprobación que hago siempre cuando instalo OBS antes que nada. Por alguna razón, en determinados portátiles, cuando capturas una pantalla se ve en negro.\nLa forma rápida de comprobarlo siendo ciego, si no tenemos unos ojitos que nos puedan echar una mano, es la siguiente:\nActiva una escena donde solo se capture tu pantalla. Inicia una grabación. Dirígete a un procesador de textos y escribe cualquier cosa. si puedes abrir un documento con mucho texto, mejor. Maximízalo. Mantén esa ventana al frente durante unos 30 o 40 segundos. Después, finaliza la grabación. Abre el vídeo y pásale el OCR con NVDA. si puedes leer parte del texto, tu pantalla no se ve en negro. Si por alguna razón No te funciona este truco, pide ayuda a alguien que vea para garantizar que en efecto tu pantalla se ve en negro. si te ha tocado este caso lo siento, te toca buscar en google y probar a ver qué solución te funciona a ti.\nEn mi caso, el problema se arregló con cerrar OBS y borrar el contenido de la carpeta \u0026ldquo;C:\\ProgramData\\obs-studio-hook\u0026quot; y recreando las fuentes de captura de juegos, pero otros necesitarán cambiar la gráfica por la que se ejecuta el programa o lo que desean capturar.\nPara finalizar Utiliza tantas escenas como necesites. Desde que escribí este artículo fui añadiendo escenas más específicas. Por ejemplo, una para capturar juegos, otra para juegos y cámara, otra para una aplicación específica, otra para una aplicación específica con cámara y una que lo único que hace es mostrar una imagen donde pone \u0026ldquo;BRB, I\u0026rsquo;m AFK\u0026rdquo; para cuando necesite ausentarme.\nInvestiga mucho y pide ayuda a gente que vea. Podemos llegar hasta un punto, pero terminar de configurarlo todo requiere que unos ojitos funcionales nos echen una mano. Técnicamente con lo explicado aquí se puede transmitir, pero seamos sinceros, queda más bonito que un vidente te encuadre la fuente de la cámara en un marco con colorines ajustado a la temática de tu Stream, por ejemplo. Lo bueno es que solo necesitarás ayuda una vez. cuando esté todo configurado, puedes hacerte una copia de la configuración.\nHay mucho más que contar, por supuesto. Pero lo dejaré aquí por hoy. Como habrás podido comprobar, he dejado cosas en los requisitos de las cuales no he escrito nada. Las dejaré para futuras entradas, aunque tienes una buena base para investigar por ti mismo, creo que lo básico está cubierto.\n","date":"2021-09-29T00:00:00Z","site":"https://jesuspavonabian.es/","tags":null,"title":"¿Hacer streaming siendo ciego?","uri":"https://jesuspavonabian.es/post/hacer-streaming-siendo-ciego/"},{"author":{"about":"La tecnología debe estar al servicio de las personas.","domain":"https://jesuspavonabian.es","email":"correo@jesuspavonabian.es","image":null,"name":"Jesús Pavón Abián","nickname":"@jpavonabian"},"categories":["Procesos","Linux","VPS"],"content":"Iba yo a escribir una entrada para este blog cuando la RAM de mi VPS se disparó. Se conoce que tengo algo chupando memoria RAM a lo burro. De hecho, he tenido que aumentar memoria al menos temporalmente, hasta ver qué le pica al servidor. el caso es que tras conseguir acceso por ssh, cosa que costó lágrimas, sudor y sangre, di con parte de la solución a mi problema: Saber qué procesos consumen más memoria y cuánta está consumiendo cada uno. La magia la realiza el comando ps de la siguiente manera: ps aux \u0026ndash;width 30 \u0026ndash;sort -rss | head Con este sencillo comando podremos ver los 10 procesos que consumen más memoria RAM en nuestro VPS. Fácil y sencillo. Ahora me falta saber por qué se está comiendo casi toda la memoria un simple script .js.\n","date":"2021-07-19T00:00:00Z","site":"https://jesuspavonabian.es/","tags":["Procesos","Linux","VPS"],"title":"Conocer los procesos que más memoria RAM ocupan en un VPS","uri":"https://jesuspavonabian.es/post/conocer-los-procesos-que-mas-memoria-ram-ocupan-en-un-vps/"},{"author":{"about":"La tecnología debe estar al servicio de las personas.","domain":"https://jesuspavonabian.es","email":"correo@jesuspavonabian.es","image":null,"name":"Jesús Pavón Abián","nickname":"@jpavonabian"},"categories":null,"content":"Los ciegos tenemos un problema bastante evidente: Que no vemos. Y el no ver nos impide hacer cosas que otro tipo de personas pueden hacer con normalidad. como ver anime en versión original. Por suerte, aquí estoy yo, para poner remedio a ese pequeñito problema. Te voy a enseñar a ver anime en japonés y enterarte de qué se está diciendo gracias a los subtítulos. Sí, como lo lees, en japonés subtitulado.\nConsiguiendo lo necesario Crunchiroll Tenemos que registrarnos en Crunchiroll. No es necesario pagar el premium si no lo deseamos. Crunchiroll es la única página que he encontrado que nos ahorra encontrar subtítulos sincronizados correctamente. Se pueden sincronizar sin ver, pero es un poco más complicado. Así que si nos lo podemos ahorrar, bienvenido sea.\nPotPlayer para esto, nada mejor que seguir este tutorial para leer subtítulos con NVDA y una vez finalizado, hacer lo siguiente para que nos lea subtítulos de Crunchiroll:\nAcceder a las preferencias con F5. Ir a accesibilidad y marcar la casilla \u0026ldquo;Leer los subtítulos de la película compuesta por texto\u0026rdquo; que está fuera del grupo de TTS. Cuidado, no nos interesa el TTS porque si lo pulsamos nos tirará de voces de Microsoft y no es lo que nos interesa. Y con esto lo tenemos todo. Lo siguiente es descargar los capítulos que queramos y abrirlos con PotPlayer.\nDescargar capítulos y reproducirlos Lo siguiente que tenemos que hacer es conseguir el archivo del capítulo de Crunchiroll. Por motivos legales, retiraré la explicación de cómo se hace aquí. Una vez conseguido el capítulo con subtítulos en formato mkv podremos reproducirlo con el programa anteriormente instalado y NVDA nos leerá los subtítulos.\n","date":"2021-03-03T00:00:00Z","site":"https://jesuspavonabian.es/","tags":null,"title":"Ver anime y leer subtítulos con NVDA","uri":"https://jesuspavonabian.es/post/ver-anime-y-leer-subtitulos-con-nvda/"},{"author":{"about":"La tecnología debe estar al servicio de las personas.","domain":"https://jesuspavonabian.es","email":"correo@jesuspavonabian.es","image":null,"name":"Jesús Pavón Abián","nickname":"@jpavonabian"},"categories":null,"content":"Buenas, hoy toca recomendar una plancha accesible para cocinar, en concreto la Tefal Optigrill GC712D12. sí, soy informático y quiero cambiar el mundo, pero también tengo que comer, y disfruto con ello.\nLa plancha avisa mediante sonidos y luces cuando está lista para cocinar, cuando está la comida poco hecha, cuando está en su punto y cuando está muy hecha. Por este motivo, es ideal para las personas ciegas o con baja visión. Descubrí el cacharrito gracias al canal de AliblueBox (abre en nueva ventana) y estoy encantado con él. Por desgracia, el vídeo ya no está disponible.\n¿Qué hace la plancha? Con la plancha accesible Tefal Optigrill GC712D12 (abre en una nueva ventana) puedes cocinar utilizando sus programas predefinidos:\nHamburguesas. Aves. sandwitches. Salchichas. Carnes. Pescados. También dispone de un modo manual, que te permite cocinar lo que quieras.\nCuando escoges una opción del programa, solo tienes que esperar a que la plancha se caliente, que suenen los tres pitidos, abrirla, meter la comida, cerrarla, y esperar a escuchar los pititos que indican el estado de la comida..\nfuncionamiento El funcionamiento es sencillo. Lo primero que tenemos que hacer es montarla. al principio cuesta lo indecible, hasta que le pillas el truco al sistema de pestañas que encajan las planchas en sus soportes.\nTras abrirla (recuerda a una sandwitchera) tenemos que colocar las dos placas. La cuestión es no forzarlas y encajarlas correctamente. No es complicado, pero como he dicho arriba cuesta. si al encajarlas se mueven levemente, algo hemos hecho mal. Luego tenemos que colocar la bandeja extraíble, donde caerán los jugos de la comida que cocinemos.\nUna vez montada la plancha, tenemos que enchufarla y cerrarla. Frente a nosotros quedará el asa con la botonera.\nBotones de la plancha, (de izquierda a derecha) Botón power. botón descongelar. botón hamburguesas. Botón aves. botón Sandwitch. botón salchichas. botón carne. Botón pescado. botón manual. botón OK. Uso de la plancha cocinar con la plancha accesible Tefal Optigrill GC712D12 (abre en una nueva ventana) es realmente sencillo.\nen primer lugar pulsamos el botón power. Oiremos un pitido. A continuación, si lo deseamos, pulsamos el botón de descongelar y nos avisará con otro pitido. Tanto si hemos pulsado el botón de descongelar como si no pulsamos el botón que corresponda a lo que queremos cocinar y escucharemos otro pitido. Pulsamos OK y esperamos que la plancha se caliente, momento en el que escucharemos una serie de pitidos Cuando la plancha esté lista, la abriremos y meteremos la comida. Tendremos que darnos prisa, y volver a cerrarla cuanto antes, pues si no posiblemente se enfriará y no avisará bien. Esperaremos a que la comida esté lista. la plancha nos avisará mediante pitidos. Los tresp primeros pitidos indicarán que la comida está poco hecha. Los tres segundos pitidos indicará que la comida está en su punto. Y para finalizar, los tres últimos pitidos indicarán que la comida está muy hecha. Importante retirarla en este punto, pues la plancha no se apaga sola y se quemará la comida. cuando tengamos la comida en el estado que queramos, solo tenemos que pulsar power para apagar la plancha (sonará un pitido) y abrirla. Con cuidado sacarla y servirla. mención especial al modo manual: Tras pulsar power, tenemos que usar el modo manual si no queremos usar un modo predefinido. Tiene tres modos de uso. Baja potencia, potencia media y potencia alta. Tras pulsar una, dos o tres veces el botón manual pulsaremos OK y esperaremos que la plancha alcance la temperatura ideal.\nCuidado aquí, pues el aviso de temperatura será el único que nos dará. Tendremos que estar atentos a que la comida no se queme.\nUn cacharrito bastante útil si tienes prisa como he dicho, la plancha accesible Tefal Optigrill GC712D12 (abre en una nueva ventana) es una plancha bastante recomendable. la comida sale genial, y si tienes prisa te puede sacar de más de un apuro. en el modo manual haces unas tostadas bastante buenas, por ejemplo, aunque lo que más uso son los programas predefinidos, es una maravilla dejar la carne cocinándose y ponerte a hacer otras cosas en la cocina sin tener que preocuparte de darle la vuelta.\nEste artículo posee enlaces de amazon Afiliados. Recibo comisión por cada compra.\r","date":"2019-04-23T00:00:00Z","site":"https://jesuspavonabian.es/","tags":null,"title":"Una plancha accesible para todos: La Tefal Optigrill GC712D12","uri":"https://jesuspavonabian.es/post/una-plancha-accesible-la-tefal-optigrill-gc712d12/"}]